const words = {
  "တူဝ်မႄႈလိၵ်ႈ": [
    'ၵ',
    'ၶ',
    'င',
    'ၸ',
    'သ',
    'ၺ',
    'တ',
    'ထ',
    'ၼ',
    'ပ',
    'ၽ',
    'ၾ',
    'မ',
    'ယ',
    'ရ',
    'လ',
    'ဝ',
    'ႁ',
    'ဢ',
  ],
  "တူၼ်းသဵင်": [
    "ပဝ်ႇ",
    "ယၵ်း",
    "ယၵ်းၸမ်ႈ",
    "ၸမ်ႈၼႃႈ",
    "ၸမ်ႈတႂ်ႈ",
    "ယၵ်းၶိုၼ်ႈ",
  ],
  "မႄႈၵပ်းငဝ်ႈ": [
    'ဢ',
    'ဢႃ',
    'ဢီ',
    'ဢေ',
    'ဢႄ',
    'ဢူ',
    'ဢူဝ်',
    'ဢေႃ',
    'ဢိုဝ်',
    'ဢိူဝ်',
  ],
  "မႄႈၵပ်းသွၼ်ႉ": [
    'ဢႆ',
    'ဢၢႆ',
    'ဢုၺ်',
    'ဢူၺ်',
    'ဢွႆ',
    'ဢိုၺ်',
    'ဢိူၺ်',
    'ဢဝ်',
    'ဢၢဝ်',
    'ဢိဝ်',
    'ဢဵဝ်',
    'ဢႅဝ်',
    'ဢႂိုဝ်',
    'ဢႂိူဝ်',
    'ဢႂ်',
  ],
  "တူဝ်ၽႅတ်းသဵင်လင် - မ်": [
    'ဢမ်',
    'ဢၢမ်',
    'ဢိမ်',
    'ဢဵမ်',
    'ဢႅမ်',
    'ဢုမ်',
    'ဢူမ်',
    'ဢွမ်',
    'ဢိုမ်',
    'ဢိူမ်',
  ],
  "တူဝ်ၽႅတ်းသဵင်လင် - ၼ်": [
    'ဢၼ်',
    'ဢၢၼ်',
    'ဢိၼ်',
    'ဢဵၼ်',
    'ဢႅၼ်',
    'ဢုၼ်',
    'ဢူၼ်',
    'ဢွၼ်',
    'ဢိုၼ်',
    'ဢိူၼ်',
  ],
  "တူဝ်ၽႅတ်းသဵင်လင် - င်": [
    'ဢင်',
    'ဢၢင်',
    'ဢိင်',
    'ဢဵင်',
    'ဢႅင်',
    'ဢုင်',
    'ဢူင်',
    'ဢွင်',
    'ဢိုင်',
    'ဢိူင်',
  ],
  "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ပ်": [
    'ဢပ်',
    'ဢၢပ်',
    'ဢိပ်',
    'ဢဵပ်',
    'ဢႅပ်',
    'ဢုပ်',
    'ဢူပ်',
    'ဢွပ်',
    'ဢိုပ်',
    'ဢိူပ်',
  ],
  "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - တ်": [
    'ဢတ်',
    'ဢၢတ်',
    'ဢိတ်',
    'ဢဵတ်',
    'ဢႅတ်',
    'ဢုတ်',
    'ဢူတ်',
    'ဢွတ်',
    'ဢိုတ်',
    'ဢိူတ်',
  ],
  "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ၵ်": [
    'ဢၵ်',
    'ဢၢၵ်',
    'ဢိၵ်',
    'ဢဵၵ်',
    'ဢႅၵ်',
    'ဢုၵ်',
    'ဢူၵ်',
    'ဢွၵ်',
    'ဢိုၵ်',
    'ဢိူၵ်',
  ],
};
final definitions = {
  "တူဝ်မႄႈလိၵ်ႈ": consonantDefinitions,
  "တူၼ်းသဵင်": toneDefinitions,
  "မႄႈၵပ်းငဝ်ႈ": vowelDefinitions,
  "မႄႈၵပ်းသွၼ်ႉ": compoundVowelDefinitions,
  "တူဝ်ၽႅတ်းသဵင်လင် - မ်": finalMDefinitions,
  "တူဝ်ၽႅတ်းသဵင်လင် - ၼ်": finalNDefinitions,
  "တူဝ်ၽႅတ်းသဵင်လင် - င်": finalNgDefinitions,
  "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ပ်": finalPDefinitions,
  "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - တ်": finalTDefinitions,
  "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ၵ်": finalKDefinitions,
};
final consonantDefinitions = {
  "ၵ": Definition(
    "ၵ",
    "တူဝ်မႄႈလိၵ်ႈ - ၵ",
    "ၵ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆၼိုင်ႈ ၼႂ်းလိၵ်ႈတႆး",
    ["ၵ"],
    ["ၵဝႃႈၵႆႇ ၵွပ်ႈတႆႇမႆႉၼိူဝ်ၵွၼ်း"],
    true,
  ),
  "ၶ": Definition(
    "ၶ",
    "တူဝ်မႄႈလိၵ်ႈ - ၶ",
    "ၶ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသွင် ၼႂ်းလိၵ်ႈတႆး။",
    ["ၶ"],
    ["ၶဝႃႈၶႆႇ မႄႈမၼ်းပႆႇမႃးငွမ်း"],
    true,
  ),
  "င": Definition(
    "င",
    "တူဝ်မႄႈလိၵ်ႈ - င",
    "င ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသၢမ် ၼႂ်းလိၵ်ႈတႆး။",
    ["င"],
    ["ငဝႃႈငူး လိူၼ်ႈမႃးၸူးတူဝ်ၶဵတ်ႇ"],
    true,
  ),
  "ၸ": Definition(
    "ၸ",
    "တူဝ်မႄႈလိၵ်ႈ - ၸ",
    "ၸ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသီႇ ၼႂ်းလိၵ်ႈတႆး။",
    ["ၸ"],
    ["ၸဝႃႈၸၢင်ႉ ပႆဢူင်ႉဢၢင်ႉၸွမ်းတၢင်း"],
    true,
  ),
  "သ": Definition(
    "သ",
    "တူဝ်မႄႈလိၵ်ႈ - သ",
    "သ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆႁႃႈ ၼႂ်းလိၵ်ႈတႆး။",
    ["သ"],
    ["သဝႃႈသိူဝ် မီးယူႇၼိူဝ်လႃႇႁႃႉ"],
    true,
  ),
  "ၺ": Definition(
    "ၺ",
    "တူဝ်မႄႈလိၵ်ႈ - ၺ",
    "ၺ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆႁူၵ်း ၼႂ်းလိၵ်ႈတႆး။",
    ["ၺ"],
    ["ၺဝႃႈၺွင်ႇ မီးၽၢႆႇႁွင်ႇၵွင်းမူး"],
    true,
  ),
  "တ": Definition(
    "တ",
    "တူဝ်မႄႈလိၵ်ႈ - တ",
    "တ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆၸဵတ်း ၼႂ်းလိၵ်ႈတႆး။",
    ["တ"],
    ["တဝႃႈတဝ်ႇ တီႈယူႇၵဝ်ႇႁိမ်းၼွင်"],
    true,
  ),
  "ထ": Definition(
    "ထ",
    "တူဝ်မႄႈလိၵ်ႈ - ထ",
    "ထ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆပႅတ်ႇ ၼႂ်းလိၵ်ႈတႆး။",
    ["ထ"],
    ["ထဝႃႈထႆ တမ်းယႆဝႆႉသၢမ်မၢၵ်ႈ"],
    true,
  ),
  "ၼ": Definition(
    "ၼ",
    "တူဝ်မႄႈလိၵ်ႈ - ၼ",
    "ၼ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆၵဝ်ႈ ၼႂ်းလိၵ်ႈတႆး။",
    ["ၼ"],
    ["ၼဝႃႈၼူ မေႃးၸူၸူၸွမ်းၸွၵ်ႉ"],
    true,
  ),
  "ပ": Definition(
    "ပ",
    "တူဝ်မႄႈလိၵ်ႈ - ပ",
    "ပ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်း ၼႂ်းလိၵ်ႈတႆး။",
    ["ပ"],
    ["ပဝႃႈပႃ ဢႅဝ်လုၺ်းႁႃၵိၼ်ယိူဝ်ႇ"],
    true,
  ),
  "ၽ": Definition(
    "ၽ",
    "တူဝ်မႄႈလိၵ်ႈ - ၽ",
    "ၽ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းဢိတ်း ၼႂ်းလိၵ်ႈတႆး။",
    ["ၽ"],
    ["ၽဝႃႈၽိုင်ႈ ၽွမ်ႉလုပ်ႇယိုင်ႈႁဵတ်းႁူင်း"],
    true,
  ),
  "ၾ": Definition(
    "ၾ",
    "တူဝ်မႄႈလိၵ်ႈ - ၾ",
    "ၾ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းသွင် ၼႂ်းလိၵ်ႈတႆး။",
    ["ၾ"],
    ["ၾဝႃႈၾႃႉ ၼႆႉပဵၼ်ၾႃႉၵၢင်ႁၢဝ်"],
    true,
  ),
  "မ": Definition(
    "မ",
    "တူဝ်မႄႈလိၵ်ႈ - မ",
    "မ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းသၢမ် ၼႂ်းလိၵ်ႈတႆး။",
    ["မ"],
    ["မဝႃႈမႄႈ သွၼ်ယဵၼ်ႇငႄႈလုၵ်ႈလၢင်း"],
    true,
  ),
  "ယ": Definition(
    "ယ",
    "တူဝ်မႄႈလိၵ်ႈ - ယ",
    "ယ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းသီႇ ၼႂ်းလိၵ်ႈတႆး။",
    ["ယ"],
    ["ယဝႃႈယုင်း ၵၢင်သုတ်းမုင်းၸင်ႇလွတ်ႈ"],
    true,
  ),
  "ရ": Definition(
    "ရ",
    "တူဝ်မႄႈလိၵ်ႈ - ရ",
    "ရ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းႁႃႈ ၼႂ်းလိၵ်ႈတႆး။",
    ["ရ"],
    ["ရဝႃႈရဵၼ်း ဢၢၼ်ႇသွၼ်ႁဵၼ်းတီႈပွင်ႇ"],
    true,
  ),
  "လ": Definition(
    "လ",
    "တူဝ်မႄႈလိၵ်ႈ - လ",
    "လ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းႁူၵ်း ၼႂ်းလိၵ်ႈတႆး။",
    ["လ"],
    ["လဝႃႈလေႃႉ ႁေႃႈၵႂႃႇတေႃႉၶူဝ်းသူၼ်"],
    true,
  ),
  "ဝ": Definition(
    "ဝ",
    "တူဝ်မႄႈလိၵ်ႈ - ဝ",
    "ဝ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းၸဵတ်း ၼႂ်းလိၵ်ႈတႆး။",
    ["ဝ"],
    ["ဝဝႃႈဝူဝ်း တူဝ်တေႃႉၶူဝ်းၵႂႃႇၵၢတ်ႇ"],
    true,
  ),
  "ႁ": Definition(
    "ႁ",
    "တူဝ်မႄႈလိၵ်ႈ - ႁ",
    "ႁ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းပႅတ်ႇ ၼႂ်းလိၵ်ႈတႆး။",
    ["ႁ"],
    ["ႁဝႃႈႁိူဝ်း ဝၢႆႈလတ်းမိူဝ်းၶၢမ်ႈတႃႈ"],
    true,
  ),
  "ဢ": Definition(
    "ဢ",
    "တူဝ်မႄႈလိၵ်ႈ - ဢ",
    "ဢ ၼႆႉပဵၼ် တူဝ်မႄႈလိၵ်ႈ မၢႆသိပ်းၵဝ်ႈ ၼႂ်းလိၵ်ႈတႆး။",
    ["ဢ"],
    ["ဢဝႃႈဢွႆႈ ၸဵမ်ႈၸွႆႈၸွႆႈၵိၼ်ဝၢၼ်"],
    true,
  ),
};
final toneDefinitions = {
  "ပဝ်ႇ": Definition(
    "ပဝ်ႇ",
    "သဵင်ပဵင်း (သဵင်သၢမ်)",
    "ပဵၼ်သဵင်ပိုၼ်ႉထၢၼ် ဢမ်ႇမီးမၢႆသဵင်သင်သေ သဵင်မၼ်းဢွၵ်ႇပဵင်းဝႆႉ ပဵၼ်သဵင်ၵၢင်ယၢဝ်းယဝ်ႉ။",
    ["ၵႃ", "မႃ", "ၼႃ", "တႃ"],
    ["ၵႃတူဝ်ၼိုင်ႈ", "မႃတူဝ်ၼိုင်ႈ", "ၼႃၵႂၢင်ႈၼႃႇ", "တႃလီတူၺ်း"],
  ),
  "ယၵ်း": Definition(
    "ယၵ်း",
    "သဵင်ယၵ်း (သဵင်ၼိုင်ႈ)",
    "ပဵၼ်သဵင်ဢၼ်တႅမ်ႇသေပိူၼ်ႈ သဵင်မၼ်းတူၵ်းဝႆႉ တႅမ်ႈဝႆႉတၢင်းလင်တူဝ်လိၵ်ႈယဝ်ႉ။",
    ["ၵႃႇ", "မႃႇ", "ၼႃႇ", "တႃႇ"],
    ["ၵႃႇၶၼ်မၼ်း", "မႃႇသႅင်", "လီၼႃႇယဝ်ႉ", "တႃႇႁဝ်း"],
  ),
  "ယၵ်းၸမ်ႈ": Definition(
    "ယၵ်းၸမ်ႈ",
    "သဵင်ယၵ်းၸမ်ႈ (သဵင်သွင်)",
    "ပဵၼ်သဵင်ဢၼ်တႅမ်ႇသေ သဵင်ပဵင်းဢိတ်းၼိုင်ႈ သဵင်မၼ်းၼႅၼ်ႈဝႆႉယဝ်ႉ။",
    ["ၵႃႈ", "မႃႈ", "ၼႃႈ", "တႃႈ"],
    ["ၵႃႈၶၼ်ယႂ်ႇ", "မႃႈႁိၼ်", "ၼႃႈႁၢင်ႈလီ", "တႃႈႁိူဝ်း"],
  ),
  "ၸမ်ႈၼႃႈ": Definition(
    "ၸမ်ႈၼႃႈ",
    "သဵင်ၸမ်ႈၼႃႈ (သဵင်သီႇ)",
    "ပဵၼ်သဵင်ဢၼ်သုင်သေပိူၼ်ႈ သဵင်မၼ်းဢွၵ်ႇသုင်သေ ၶၢတ်ႇၵႂႃႇဝႆးဝႆးယဝ်ႉ။",
    ["ၵႃႉ", "မႃႉ", "ၼႃႉ", "တႃႉ"],
    ["ၵႃႉၶၢႆလီ", "ၶီႇမႃႉ", "ၵႂႃႇၼႃႉ", "ႁဵတ်းတႃႉ"],
  ),
  "ၸမ်ႈတႂ်ႈ": Definition(
    "ၸမ်ႈတႂ်ႈ",
    "သဵင်ၸမ်ႈတႂ်ႈ (သဵင်ႁႃႈ)",
    "ပဵၼ်သဵင်ဢၼ်သုင်သေ သဵင်ပဵင်းဢိတ်းၼိုင်ႈ သဵင်မၼ်းဢွၵ်ႇယၢဝ်းသေ ၼိမ်ဝႆႉယဝ်ႉ။",
    ["ၵႃႈ", "မႃႉ", "ၼႃႈ", "တႃႈ"],
    ["ၵႃႉ", "မႃႉ", "ၼႃႈ", "တႃႈ"], // Note: Displaying logic for the marks
  ),
  "ယၵ်းၶိုၼ်ႈ": Definition(
    "ယၵ်းၶိုၼ်ႈ",
    "သဵင်ယၵ်းၶိုၼ်ႈ (သဵင်ႁူၵ်း)",
    "ပဵၼ်သဵင်ဢၼ်လႅၵ်ႈလၢႆႈ သဵင်မၼ်းတေတူၵ်းသေ ၶိုၼ်းၶိုၼ်ႈသုင်ၵႂႃႇယဝ်ႉ။",
    ["ၵႃး", "မႃး", "ၼႃး", "တႃး"],
    ["ၵႃးလူင်", "မႃးတီႈၼႆႈ", "ၼႃးတူင်ႇ", "တႃးယႃ"],
  ),
};
final vowelDefinitions = {
  "ဢႃ": Definition(
    "ဢႃ",
    "မႄႈၵပ်းငဝ်ႈ - ဢႃ (သဵင်ပၢၵ်ႇပူၺ်)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢႃ' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇလင် တူဝ်မႄႈလိၵ်ႈ။ ၸႂ်ႉတႅမ်ႈလႆႈတင်း သဵင်ယၢဝ်းလႄႈ သဵင်ပိတ်းယဝ်ႉ။",
    ["တႃ", "ပႃႇ", "သႃႈ", "ၶႃး", "မႃႉ", "သႃႊ"],
    [
      "မႃႉလႃး မႃးယႃႉ ပႃႇၶႃး ႁႃမႃး ယႃႇၸႃႉ",
      "ပႃႈလႃႉၵႃႉမႃႉ မႃႉၵႃႈၼႃႇဝႃႈ ပႃႈသႃႇမႃးတႃႉ ႁႃးၵႂႃႇႁႃယႃ ႁႃပႃးပႃမႃး",
    ],
  ),
  "ဢီ": Definition(
    "ဢီ",
    "မႄႈၵပ်းငဝ်ႈ - ဢီ (သဵင်ပၢၵ်ႇၵႅပ်ႈ)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢီ' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇၼိူဝ် တူဝ်မႄႈလိၵ်ႈ။ ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ၸႅင်ႈလႅင်းလီ။",
    ["ပီ", "ၼီႇ", "သီႈ", "လီး", "မီႉ", "သီႊ"],
    [
      "မီပီး မီးတီႈ ပီႈယီႈ တီႉမီ တီႈၵီႇ",
      "ပီႈဢီႇၺႃးမီ ၵႃႈတီႈလႃႇႁႃႉ မီပီးလီၼႃႇ တီႉမီမႃးတႃႉ ဝီးမီးတီႈၽႃ",
    ],
  ),
  "ဢူ": Definition(
    "ဢူ",
    "မႄႈၵပ်းငဝ်ႈ - ဢူ (သဵင်ပၢၵ်ႇၸုမ်း)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢူ' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇတႂ်ႈ တူဝ်မႄႈလိၵ်ႈ။ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇမႃးတီႈႁူၺ်ႇပၢၵ်ႇ။",
    ["ၵူ", "ပူႇ", "သူႈ", "ႁူး", "ၼူႉ", "သူႊ"],
    [
      "ငူးယူႇ ႁူးၼူ ယူးလူႉ ပူႇသူ ႁူႉယူႇ",
      "ငူးမီးတီႈႁူး ငူးမႃးၸူးၼူ သူလီႁူႉယူႇ ပူယႃႉၼႃးသူ ဝူဝႃၼႃႈႁူႇ",
    ],
  ),
  "ဢေ": Definition(
    "ဢေ",
    "မႄႈၵပ်းငဝ်ႈ - ဢေ (သဵင်ယဵတ်ႇ)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢေ' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇၼႃႈ တူဝ်မႄႈလိၵ်ႈ။ ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ဢွၵ်ႇသဵင်ၵၢင်ပၢၵ်ႇ။",
    ["ၵေ", "လေႇ", "ၸေႈ", "ပေး", "ၼေႉ", "သေႊ"],
    [
      "တေၸေး သေႇသေႇ ၸေႈဢေႇ ပေလေး တေႁေႈ",
      "ပႃႈသေးၸေးယူႇ မႃးႁႃၸေႈသႃ ၵႃႈတီႈရသေႉ ယႃႇပေမႃးယႃႉ ၶူးတေမႃးထႃႉ",
    ],
  ),
  "ဢႄ": Definition(
    "ဢႄ",
    "မႄႈၵပ်းငဝ်ႈ - ဢႄ (သဵင်ပၢၵ်ႇၵႂၢင်ႈ)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢႄ' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇၼႃႈ တူဝ်မႄႈလိၵ်ႈ။ သဵင်မၼ်းတေၵႂၢင်ႈသေ သဵင်ဢေ။",
    ["ၵႄ", "မႄႇ", "ၼႄႈ", "ဝႄး", "ပႄႉ", "လႄႊ"],
    [
      "ပႄႉမႄႈ ႁႄတႄႉ ၶႄးၶႄး သႄႉၼႄး တႄႉတႄႉ",
      "မႃးႁႃတီႉပႄႉ ပႄႉမႄႈႁႄၼႃႇ ၵႃၵႄဝႄႈပႄႉ ဝႃႈၼႄလီလီ တေလီယူႇတႄႉ",
    ],
  ),
  "ဢူဝ်": Definition(
    "ဢူဝ်",
    "မႄႈၵပ်းငဝ်ႈ - ဢူဝ် (သဵင်ဢူမ်)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢူဝ်' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇၼႃႈလႄႈၽၢႆႇလင် တူဝ်မႄႈလိၵ်ႈ။ မီးသဵင်ဢၼ်ၵူဝ်ႇဝႆႉၼႂ်းပၢၵ်ႇ။",
    ["ၵူဝ်", "လူဝ်ႇ", "ၶူဝ်ႈ", "ႁူဝ်း", "မူဝ်ႉ", "သူဝ်ႊ"],
    [
      "ဝူဝ်းသူဝ်း ၵူဝ်ႁူဝ်ႉ ၶူဝ်ႈထူဝ်ႇ ထူဝ်ႇႁူဝ် ၸူဝ်းၶူဝ်",
      "ဝူဝ်းမီးတီႈၶူဝ် ပီႈငူဝ်ႉၵူဝ်ဝူဝ်း ဝီႁူဝ်သေလႄႈ ႁႃးတေၸူဝ်းလႄႇ ပႃးၶူဝ်းမႃးတႃႉ",
    ],
  ),
  "ဢေႃ": Definition(
    "ဢေႃ",
    "မႄႈၵပ်းငဝ်ႈ - ဢေႃ (သဵင်ပၢၵ်ႇဝူင်ႇ)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢေႃ' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇၼႃႈလႄႈၽၢႆႇလင် တူဝ်မႄႈလိၵ်ႈ။ မီးသဵင်မိူၼ်သဵင်ဢေႃး ၼႂ်းၵႂၢမ်းထႆး။",
    ["ၵေႃ", "ပေႃႇ", "မေႃႈ", "လေႃး", "ၼေႃႉ", "သေႃႊ"],
    [
      "ႁေႃႈလေႃႉ မေႃႁေႃႈ ပေႃးပေႃႉ မေႃႈၼေႃႇ သေႃႉပေႃ",
      "ပေႃႈမႄႈၶီႇလေႃႉ ႁေႃႈလေႃႉဝူဝ်းမႃး မႃးတေႃႉၶူဝ်းဝႃႇ ယႃႇပေမေႃးမႄး ႁႃမေႃႈမႃးတႃႉ",
    ],
  ),
  "ဢိုဝ်": Definition(
    "ဢိုဝ်",
    "မႄႈၵပ်းငဝ်ႈ - ဢိုဝ် (သဵင်ၶိုၼ်ႈၶူႈၼူဝ်)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢိုဝ်' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇၼိူဝ်လႄႈၽၢႆႇလင် တူဝ်မႄႈလိၵ်ႈ။ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇမႃးသိုဝ်ႈသိုဝ်ႈ။",
    ["ၵိုဝ်", "လိုဝ်ႇ", "ၸိုဝ်ႈ", "တိုဝ်း", "သိုဝ်ႉ", "မိုဝ်ႊ"],
    [
      "ၽႃႇမိုဝ်း သိုဝ်ႉတိုဝ်း သိုဝ်ႈသိုဝ်ႈ လိုဝ်ႈယူႇ တီႈတိုဝ်ႉ",
      "မိုဝ်းသိုဝ်ႈလီၼႃႇ ၸိုဝ်ႈလိုဝ်းတႄႉတႄႉ မႃးလိုဝ်ႈတီႈတိုဝ်ႉ တေဝႃႈၵႃႈႁိုဝ်? ယႃႇပေတိုဝ်ၼႃႈ",
    ],
  ),
  "ဢိူဝ်": Definition(
    "ဢိူဝ်",
    "မႄႈၵပ်းငဝ်ႈ - ဢိူဝ် (သဵင်ၼႅၼ်ႈ)",
    "ပဵၼ်သရဢၼ်ပၼ်သဵင် 'ဢိူဝ်' သေ တႅမ်ႈဝႆႉတီႈၽၢႆႇၼိူဝ်လႄႈၽၢႆႇလင် တူဝ်မႄႈလိၵ်ႈ။ သဵင်မၼ်းတေၼႅၼ်ႈသေ သဵင်ဢိုဝ်။",
    ["ၵိူဝ်", "မိူဝ်ႇ", "သိူဝ်ႈ", "ႁိူဝ်း", "ၼိူဝ်ႉ", "ပိူဝ်ႊ"],
    [
      "ၶိူဝ်းသိူဝ် ၼိူဝ်ႁိူဝ်း ၸိူဝ်ႉၶိူဝ်း မိူဝ်းၼိူဝ် ထိူဝ်ၼိူဝ်ႉ",
      "ယႃႇပေယိုဝ်းသိူဝ် ပေႃးမိူဝ်းၼႃႈမႃး ၶိူဝ်းႁႃးတေႁိူဝ်ႈ ၵႂႃႇမိူဝ်ႈႁိုဝ်းဢိူဝ်ႈ ၶိူဝ်းသိူဝ်ယႃႇငိူဝ်ႈ",
    ],
  ),
};
final compoundVowelDefinitions = {
  "ဢႆ": Definition(
    "ဢႆ",
    "မႄႈၵပ်းသွၼ်ႉ - ဢႆ",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်း 'ယ' (ဢႆ) သေပဵၼ်သဵင်ပိတ်းဢၼ်ပၼ်သဵင် 'ဢႆ' ယဝ်ႉ။",
    ["ၵႆ", "ၶႆႇ", "ၼႆႈ", "ၾႆး", "ၵႆႉ", "တႆႊ"],
    [
      "ၵႆႇၶႆႇ ဝႆႉၼႆႈ တႆႈၾႆး တႆးၵႆႉ ထႆႁႆႈ",
      "ၵႆႇမႄႈမႃးၶႆႇ မီးဝႆႉတီႈၼႆႈ ၵႆႉၵႆႉမႃးလႄႇ တႆႈၾႆးဝႆႉတႃႉ တႆးႁိူဝ်ႈဝႆႉဢိူဝ်ႈ",
    ],
  ),
  "ဢၢႆ": Definition(
    "ဢၢႆ",
    "မႄႈၵပ်းသွၼ်ႉ - ဢၢႆ",
    "ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ဢဝ် 'ဢႃ' ၵပ်းတင်း 'ယ' (ဢၢႆ) သေ ဢွၵ်ႇသဵင်ၵႂၢင်ႈလီယဝ်ႉ။",
    ["ၶၢႆ", "ငၢႆႈ", "ႁၢႆ", "လၢႆႈ", "သၢႆႉ", "ၸၢႆႊ"],
    [
      "ၶၢႆၵႂၢႆး ၸၢႆႇငၢႆႈ ႁၢႆလၢႆ လၢႆႈလၢႆး ၽၢႆႇသၢႆႉ",
      "ဢၢႆႈၸၢႆးၶၢႆၵႂၢႆး ဝၢႆးၼႆႉႁၢႆလၢႆ ၶၢႆငၢႆႈတႄႉတႄႉ ၽႃႈလၢႆႈပၢႆႉၽႃ ႁႃဝၢႆမႃးတႃႉ",
    ],
  ),
  "ဢုၺ်": Definition(
    "ဢုၺ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢုၺ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူ' ၵပ်းတင်း 'ယ' (ဢုၺ်) သေ ဢွၵ်ႇသဵင်ၼႅၼ်ႈဝႆႉၼႂ်းပၢၵ်ႇယဝ်ႉ။",
    ["ၵုၺ်", "ဢုၺ်ႉ", "ၽုၺ်ႇ", "ယုၺ်း", "တုၺ်ႈ", "လုၺ်ႊ"],
    [
      "ပႃႈတုၺ်ႈ ဢုၺ်ႉဢုၺ်ႉ ၵုၺ်ႉၽုၺ်ႇ မႆၵုၺ် ယုၺ်းယုၺ်း",
      "ပႃႈတုၺ်ႈဢုၺ်ႉၼႃႇ ၵုၺ်ႉႁူဝ်မႆႉၽုၺ်း ၽုၺ်ႇသေႃးဝႆႉလႄႈ မႆၵုၺ်မီးၼႆႈ ယႃႇႁႆႈဢုၺ်ဢုၺ်",
    ],
  ),
  "ဢူၺ်": Definition(
    "ဢူၺ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢူၺ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူဝ်' ၵပ်းတင်း 'ယ' (ဢူၺ်) သေ ဢွၵ်ႇသဵင်ယၢဝ်းသေ သဵင်ဢုၺ်ယဝ်ႉ။",
    ["ၵူၺ်ႈ", "မူၺ်ႉ", "တူၺ်း", "ႁူၺ်ႈ", "တူၺ်", "သူၺ်ႊ"],
    [
      "ၵေႃၵူၺ်ႈ ထူၺ်ႈမူၺ်ႉ ၸူၺ်ႉတူၺ်း ႁူၺ်ႇၵူၺ်ႈ ႁူၺ်ႈတူၺ်",
      "ၵေႃၵူၺ်ႈတီႈႁူၺ်ႈ ပီႈသူၺ်ႇမေႃတူၺ်း တူၺ်းတီႈၽူၺ်းမႆႉ ၼၢႆးမူၺ်လိုဝ်ႈယူႇ ၵႃႈတီႈႁူၺ်ႈတူၺ်",
    ],
  ),
  "ဢွႆ": Definition(
    "ဢွႆ",
    "မႄႈၵပ်းသွၼ်ႉ - ဢွႆ",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေႃ' ၵပ်းတင်း 'ယ' (ဢွႆ) သေ ပဵၼ်သဵင်ဢၼ်ပၢၵ်ႇဝူင်ႇယဝ်ႉ။",
    ["လွႆ", "ၼွႆႉ", "သွႆး", "ယွႆႈ", "ႁွႆႇ", "ပွႆႊ"],
    [
      "လွႆၼွႆႉ သွႆးယွႆႈ ၵွႆႈႁွႆႈ ปွႆႇႁွႆႇ လွႆးလွႆး",
      "ၼိူဝ်လွႆမီးပွႆး ပူႇလွႆတွႆႇႁွႆႈ ႁိူဝ်ႇၵေႃႈပေႃးယွႆႉ ၸၢႆးသႆႇမႃးၸွႆႈ ၵွႆႈတွႆႇလွႆးလွႆး",
    ],
  ),
  "ဢိုၺ်": Definition(
    "ဢိုၺ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢိုၺ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိုဝ်' ၵပ်းတင်း 'ယ' (ဢိုၺ်) သေ ၵႆႉၸႂ်ႉၼႂ်းၵႂၢမ်းႁွင်ႉႁိူၺ်ႉယဝ်ႉ။",
    ["ႁိူၺ်ႉ", "ဢိုၺ်း", "ႁိူၺ်း", "ၵေႃႉႁိူၺ်း", "သူၺ်ႇ", "တိုၺ်ႊ"],
    [
      "ဢလိူၺ်ႉသူၵေႃႈ! ဢိူၺ်းႁိူၺ်း! တႃႉလီၶႆႈၶူဝ် ႁိူၺ်ႉ! သူၸိူဝ်းၼႆႉ မႃးလႃႈၵေႃႉႁိူၺ်း!",
      "ဢလိူၺ်ႉသူၵေႃႈ! ဢိူၺ်းႁိူၺ်း! တႃႉလီၶႆႈၶူဝ် ႁိူၺ်ႉ! သူၸိူဝ်းၼႆႉ မႃးလႃႈၵေႃႉႁိူၺ်း!",
    ],
  ),
  "ဢိူၺ်": Definition(
    "ဢိူၺ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢိူၺ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိူဝ်' ၵပ်းတင်း 'ယ' (ဢိူၺ်) သေ ပဵၼ်သဵင်ဢွၵ်ႇၼႅၼ်ႈယဝ်ႉ။",
    ["ႁိူၺ်ႉ", "ၵႂၢႆး", "ဝူဝ်း", "တူဝ်", "ၼႆႉ", "ၶိူၺ်ႊ"],
    [
      "ႁိူၺ်ႉ! ၵႂၢႆးတူဝ်ၼႆႉ ႁိူၺ်ႉႁိူၺ်ႉ! ဝူဝ်းတူဝ်ၼႆႉ",
      "ႁိူၺ်ႉ! ၵႂၢႆးတူဝ်ၼႆႉ ႁိူၺ်ႉႁိူၺ်ႉ! ဝူဝ်းတူဝ်ၼႆႉ",
    ],
  ),
  "ဢဝ်": Definition(
    "ဢဝ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢဝ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်း 'ဝ' (ဢဝ်) သေ ပဵၼ်သရသဵင်ပိတ်းဢၼ်ၸႂ်ႉၼမ်ယဝ်ႉ။",
    ["ၸဝ်ႈ", "ၶဝ်ႈ", "ႁဝ်း", "ဢဝ်", "ယဝ်ႉ", "မဝ်ႊ"],
    [
      "ၸဝ်ႈၶဝ်ႈ ၶဝ်ႈႁဝ်း ႁဝ်းဢဝ် ၸဝ်ႉၸဝ်ႉ ယဝ်ႉယဝ်ႉ",
      "ႁဝ်းဢဝ်ၶဝ်ႈၸဝ်ႉ ဢဝ်ပႃးထူဝ်ႇၼဝ်ႈ ယႃႇပေၵဝ်းႁဝ်း လိုဝ်ႈသဝ်းငဝ်ႈမႆႉ ၶဝ်ၵႆႉမဝ်းလဝ်ႈ",
    ],
  ),
  "ဢၢဝ်": Definition(
    "ဢၢဝ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢၢဝ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢႃ' ၵပ်းတင်း 'ဝ' (ဢၢဝ်) သေ ပဵၼ်သဵင်ယၢဝ်းဢၼ်ဢွၵ်ႇၸႅင်ႈလီယဝ်ႉ။",
    ["မၢဝ်ႇ", "သၢဝ်", "ၶၢဝ်", "ငၢဝ်ႈ", "ၸၢဝ်ႈ", "ႁၢဝ်ႊ"],
    [
      "မၢဝ်ႇသၢဝ် ၶၢဝ်ၶၢဝ် ယႃႇငၢဝ်ႈ ၶဝ်ႈၸၢဝ်ႈ ႁၢဝ်ႈၼႃႇ",
      "ၶၢဝ်ႇငၢဝ်းတႆးမၢဝ်း ၶၢဝ်းၼႆႉလီၼႃႇ ယႃႇၵႆႉလႄႇသၢဝ် ၵူဝ်ဢၢဝ်ႁဝ်းထႃႉ မႃႉမီးသၢဝ်းတူဝ်",
    ],
  ),
  "ဢိဝ်": Definition(
    "ဢိဝ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢိဝ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိ' ၵပ်းတင်း 'ဝ' (ဢိဝ်) သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇသဵင်ပိတ်းယဝ်ႉ။",
    ["သိဝ်ႇ", "ၼိဝ်ႉ", "တိဝ်ႈ", "ႁိဝ်ႈ", "လိဝ်", "ပိဝ်ႊ"],
    [
      "သိဝ်ႇၽၢႆ လၢႆၼိဝ်ႉ ၵိဝ်ႉတႃ သႃႉတိဝ်ႈ ႁိဝ်ႈၼိဝ်ႉ",
      "ဢဝ်သိဝ်ႇမႃးတႃႉ တေသိဝ်ႇမႆႉၽိဝ် ပူႇထဝ်ႈလိဝ်ပေႃ တိဝ်ႈသႃႉမႃးလႄႈ ၼိဝ်ႉပိဝ်ၵႂႃႇယဝ်ႉ",
    ],
  ),
  "ဢဵဝ်": Definition(
    "ဢဵဝ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢဵဝ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေ' ၵပ်းတင်း 'ဝ' (ဢဵဝ်) သေ မီးသဵင်ယၢဝ်းသေ သဵင်ဢိဝ်ယဝ်ႉ။",
    ["ၶဵဝ်ႈ", "ၵဵဝ်ႉ", "လဵဝ်", "ၸဵဝ်း", "ၽဵဝ်ႈ", "သဵဝ်ႊ"],
    [
      "ၶဵဝ်ႈၵဵဝ်ႉ ယိူဝ်ႈၶဵဝ် မိူဝ်ႈလဵဝ် ၸဵဝ်းႁဵဝ်ႇ ၽဵဝ်ႈယဝ်ႉ",
      "သီၶဵဝ်ႈၶၢဝ်ၶၢဝ် ၸဝ်ႉၸဝ်ႉၸဵဝ်းၸဵဝ်း ႁဝ်းမႃးၵေႃႉလဵဝ် ၵႃႈတီႈလႃႈသဵဝ်ႈ ပႃးၶဝ်ႈၼဵဝ်မႃး",
    ],
  ),
  "ဢႅဝ်": Definition(
    "ဢႅဝ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢႅဝ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢႄ' ၵပ်းတင်း 'ဝ' (ဢႅဝ်) သေ ပဵၼ်သဵင်ၵႂၢင်ႈဢၼ်ဢွၵ်ႇၸႅင်ႈလီယဝ်ႉ။",
    ["လႅဝ်း", "ၵႅဝ်ႈ", "ဢႅဝ်ႇ", "ၶႅဝ်ႉ", "ၶႅဝ်း", "ငႅဝ်ႊ"],
    [
      "လႅဝ်းၽၢႆ ၸၢႆးၵႅဝ်ႈ ဢႅဝ်ႇၽႅဝ် ဢႅဝ်ၶႅဝ်ႉ ၶႅဝ်းၼႃႇ",
      "လႅဝ်းတႆးၽၢႆၼႃႇ လႅဝ်းယႃႇလူႉလႅဝ် မႃးၽႅဝ်တီႈၼႆႈ လႆႈပႃၶႅဝ်ႉမႃး ႁႃးယႃႇပေငႅဝ်",
    ],
  ),
  "ဢႂ်": Definition(
    "ဢႂ်",
    "မႄႈၵပ်းသွၼ်ႉ - ဢႂ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်း 'ဝ' (ဢႂ်) သေ ၵႆႉၸႂ်ႉတႅမ်ႈၼႂ်းၵႂၢမ်းတႆးတႄႉတႄႉယဝ်ႉ။",
    ["မႂ်", "သႂ်ႇ", "ၽႂ်း", "ၼႂ်း", "ၸႂ်", "ယႂ်ႇ"],
    [
      "မႂ်မႆႉ သႂ်ႇဝႆႉ ၽႂ်းၽႂ်း ၼႂ်းၸႂ် သႂ်မႂ်ႇ",
      "မႂ်မႆႉမီးလႂ်? ၽႂ်ႁႂ်ႈမႂ်းမႃး ပႂ်ႉပႃႈသႂ် lႄႈ ၶႂ်ႈၸႂ်လီလီ မီးတီႈၸႂ်ယႂ်ႇ",
    ],
  ),
};
final finalMDefinitions = {
  "ဢမ်": Definition(
    "ဢမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်းတူဝ်ၽႅတ်း 'မ' သေ ပဵၼ်သဵင်ပိတ်းပၢၵ်ႇဢၼ်ဢွၵ်ႇသဵင်ၼႅၼ်ႈယဝ်ႉ။",
    ["ၵမ်", "ၼမ်", "ဢမ်ႇ", "ယမ်း", "ၶမ်း", "ၵမ်ႇ"],
    [
      "ၵမ်ဝႆႉ ၼမ်ၼမ် ဢမ်ႇၸမ် ၼမ်ႉယမ်း ၶမ်းၼမ်",
      "ၵမ်ဝႆႉၶမ်းၼမ်ၼမ် မိူဝ်ႈၶမ်ႈယႃႇၸႂ်လမ် ၸွႆႈႁဝ်းတမ်ၶဝ်ႈၵမ်ႇ ပႃလမ်ယူႇၼႂ်းၼမ်ႉ မႃးယူႇၸမ်ၸမ်လႄႈ",
    ],
  ),
  "ဢၢမ်": Definition(
    "ဢၢမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢၢမ်",
    "ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ဢဝ် 'ဢႃ' ၵပ်းတင်း 'မ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇၸႅင်ႈလႅင်းလီယဝ်ႉ။",
    ["လၢမ်", "ယၢမ်း", "ထၢမ်", "ၸၢမ်း", "ၵၢမ်ႇ", "ႁၢမ်ႊ"],
    [
      "ဢလၢမ်ႇ တမ်ယၢမ်း လၢမ်းထၢမ် ၸၢမ်းၵၢမ်ႇ ႁၢမ်ၶၢမ်ႈ",
      "ႁၢမ်ဢလၢမ်ႇမႃးတႃႉ ၾႆးလၢမ်းၵႂႃႇၵူႈတီႈ ၸွႆႈၶႄၾႆးလၢမ်းလႄႈ ယႃႇပႂ်ႉမိူဝ်ႈပႂ်ႉယၢမ်း ယူႇလီလီငၢမ်းငၢမ်း",
    ],
  ),
  "ဢိမ်": Definition(
    "ဢိမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိ' ၵပ်းတင်း 'မ' သေ ပဵၼ်သဵင်ပိတ်းဢၼ်ဢွၵ်ႇသဵင်ပိတ်းပၢၵ်ႇယဝ်ႉ။",
    ["ၵိမ်း", "ႁိမ်း", "ဢိမ်", "ၶိမ်း", "ၼိမ်", "ၸိမ်း"],
    [
      "ၵိမ်းၾႆး ႁိမ်းၽႃ ဢိမ်ၶိမ်း ၸိမ်းတူၺ်း ၼိမ်ၼိမ်",
      "ၵိမ်းၾႆးမီးႁိမ်းၽႃ ႁႃဢိမ်ၶိမ်းမႃးတႃႉ ယူႇပႂ်ႉထႃႈၼိမ်ၼိမ် ၽိမ်းၼမ်ႉၶဝ်ႈဝႆႉလႄႈ ယႃႇပေၵူႈပေယိမ်",
    ],
  ),
  "ဢဵမ်": Definition(
    "ဢဵမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢဵမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေ' ၵပ်းတင်း 'မ' သေ မီးသဵင်ယၢဝ်းသေ သဵင်ဢိမ်ယဝ်ႉ။",
    ["သဵမ်", "ၸဵမ်း", "တဵမ်", "ၶဵမ်", "ပဵမ်ႉ", "တဵမ်ႊ"],
    [
      "ယိမ်သဵမ် ၸဵမ်ၸဝ်ႉ တဵမ်တဵမ် ၶဵမ်တိူဝ်ႉ တီႈပဵမ်ႉ",
      "ဢဝ်ၶေႃသဵမ်မႃးလႄႈ ႁဝ်းတေသဵမ်ႈမႆႉႁူဝ်ႉ သႂ်ႇၶဵမ်ဝႆႉတဵမ်တဵမ် ၵိူဝ်ၸဵမ်းၸွႆႉၵႃႈႁိုဝ်? ဝႃႈယူႇၸဵမ်မိူဝ်ႈၸဝ်ႉ",
    ],
  ),
  "ဢႅမ်": Definition(
    "ဢႅမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢႅမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢႄ' ၵပ်းတင်း 'မ' သေ ပဵၼ်သဵင်ပၢၵ်ႇၵႂၢင်ႈဢၼ်ပိတ်းဝႆႉယဝ်ႉ။",
    ["တႅမ်ႈ", "လႅမ်", "ထႅမ်", "ၶႅမ်ႉ", "ပႅမ်း", "ၼႅမ်ႊ"],
    [
      "ၵမ်တႅမ်ႈ ปၢႆလႅမ် ၸွႆႈထႅမ် ၶႅမ်ႉၼႃႇ တႅမ်ႈလီ",
      "တႅမ်ႈဝႆႉႁႂ်ႈၶႅမ်ႉၶႅမ်ႉ ဢၢႆႈတႅမ်ႇၵႃႉပႅမ်းမႃး ထႅမ်ၼမ်ႉဝႆႉထႃႈလႄႈ မေႃႈၶဝ်ႈတေၶႅမ်ႈယဝ်ႉ သဵမ်ႈမႆႉလႅမ်ဝႆႉလႄႈ",
    ],
  ),
  "ဢုမ်": Definition(
    "ဢုမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢုမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူ' ၵပ်းတင်း 'မ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇမႃးတီႈႁူၺ်ႇပၢၵ်ႇယဝ်ႉ။",
    ["ဢုမ်", "ၼုမ်ႇ", "ယုမ်ႉ", "ပုမ်", "သုမ်ႉ", "ၵုမ်ႇ"],
    [
      "ဢုမ်ၼမ်ႉ ၸၢႆးၼုမ်ႇ ယုမ်ႉတူၺ်း တီႈပုမ် ႁိမ်းသုမ်ႉ",
      "တုမ်မႆႉမီးတႂ်ႈဢုမ် ႁႃဝႆႉႁႂ်ႈၵုမ်ႇၵုမ်ႇ လုမ်းလႃးၸၢႆးၶဝ်တႃႉ ယုမ်ႉယုမ်ႉယၢႆႈယၢႆႈယူႇ တုမ်တုမ်ႉပုမ်ၶဝ်ဢိူဝ်ႈ",
    ],
  ),
  "ဢူမ်": Definition(
    "ဢူမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢူမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူဝ်' ၵပ်းတင်း 'မ' သေ ပဵၼ်သဵင်ဢူမ်ဝႆႉၼႂ်းပၢၵ်ႇသေပိတ်းယဝ်ႉ။",
    ["ၵူမ်ႈ", "တူမ်ႈ", "ၸူမ်း", "လူမ်း", "ထူမ်ႇ", "ယူမ်း"],
    [
      "ၵူမ်ႈႁူဝ် တူဝ်ၵူမ်ႈ ႁူမ်ႇတူမ်း လူမ်ႈလူမ်ႈ ႁူမ်ႇမႆႉ",
      "ၵူမ်ႈႁူဝ်သေမႃးလႄႈ ႁဝ်းၸွႆႈၶဝ်တူမ်ႈၶဝ်ႈ ၸူမ်းသိူဝ်းၸႂ်တႄႉတႄႉ လူမ်းပဝ်ႇမႆႉယူမ်းလူမ်ႉ ယႃႇပေထူမ်ႇၼမ်ႉလၢႆး",
    ],
  ),
  "ဢွမ်": Definition(
    "ဢွမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢွမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေႃ' ၵပ်းတင်း 'မ' သေ ပဵၼ်သဵင်ပၢၵ်ႇဝူင်ႇဢၼ်ပိတ်းယဝ်ႉ။",
    ["သွမ်ႈ", "လွမ်ႉ", "ယွမ်ႉ", "ထွမ်ႇ", "ႁွမ်", "ဢွမ်ႈ"],
    [
      "သွမ်ႈၼႃး မႃးၸွမ်း ဢွမ်ႈပွမ်ႈ ထွမ်ႇလႄႈ ႁွမ်တႄႉ",
      "ၶဝ်ၽွမ်ႉသွမ်ႈၼႃးယူႇ လွမ်ႉႁူဝ်ႉဝႆႉလီလီ တေၵႂႃႇၸွမ်းသူဢိူဝ်ႈ ယွမ်ႉမႆဝႆႉသွမ်ႇသွမ်ႇ ၸွမ်းထွမ်ႇတူၺ်းလႄႈ",
    ],
  ),
  "ဢိုမ်": Definition(
    "ဢိုမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိုမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိုဝ်' ၵပ်းတင်း 'မ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇမႃးသိုဝ်ႈသိုဝ်ႈယဝ်ႉ။",
    ["ၸိုမ်း", "တိုမ်", "လိုမ်း", "ၵိုမ်း", "ၶိုမ်း", "လိုမ်ႉ"],
    [
      "ၵမ်ၸိုမ်း ယႃႇလိုမ်း မႄးလိုမ်ႉ ၼိူဝ်တိုမ်း ၵိုမ်းၵိုမ်း",
      "ၵမ်ၸိုမ်းမီးတီႈၼႆႈ ယႃႇပေဝႆႉၸႂ်တိုမ် ၵႂၢမ်းႁဝ်းยႃႇပေလိုမ်း ႁႂ်ႈၵိုမ်းဝႆႉတေႃႇၸူဝ်ႈ ဢဝ်ၼၢမ်ၶိုမ်းႁူဝ်ႉဝႆႉ",
    ],
  ),
  "ဢိူမ်": Definition(
    "ဢိူမ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိူမ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိူဝ်' ၵပ်းတင်း 'မ' သေ ပဵၼ်သဵင်ၼႅၼ်ႈဢၼ်ပိတ်းပၢၵ်ႇယဝ်ႉ။",
    ["လိူမ်", "လိူမ်ႈ", "ၸိူမ်ႈ", "ပိူမ်ႉ", "ၵိူမ်ႈ", "မိူမ်ႊ"],
    [
      "ငူးလိူမ် တႃလိူမ်ႈ မီးၵိူမ်ႈ ၵိူဝ်ၸိူမ်ႈ ပိူမ်ႉၼႃႇ",
      "ငူးလိူမ်တူဝ်ယႂ်ႇၼႃႇ လႆႇတႃလိူမ်ႈလိူမ်ႈသေ ႁိူဝ်ႇပေႃးၶႆႈၸိူမ်ႈယဝ်ႉ ၶၢႆႉတူၼ်ႈမႆႉဝႆႉလႄႈ ၼိူဝ်ႉမူၸေႃးပိူမ်ႉၼႃႇ",
    ],
  ),
};
final finalNDefinitions = {
  "ဢၼ်": Definition(
    "ဢၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်းတူဝ်ၽႅတ်း 'ၼ' သေ ပဵၼ်သဵင်ပိတ်းပၢႆလႅၼ်းဢၼ်ဢွၵ်ႇသဵင်ၼႅၼ်ႈယဝ်ႉ။",
    ["ၽၼ်း", "လၼ်း", "ႁၼ်", "မၼ်း", "ဝၼ်း", "တၼ်း"],
    [
      "ၸၢႆးၸၼ်ၽၼ်းမႆႉယူႇ မၼ်းလၼ်းၵၼ်းတႄႉတႄႉ ၵႃႈၶၼ်မၼ်းယႂ်ႇၼႃႇ ႁၼ်မၼ်းပၼ်ဢၼ်ၼၼ်ႉ ဝၼ်းၼႆႉဢမ်ႇပႆႇတၼ်း",
      "ၸၢႆးၸၼ်ၽၼ်းမႆႉယူႇ မၼ်းလၼ်းၵၼ်းတႄႉတႄႉ ၵႃႈၶၼ်မၼ်းယႂ်ႇၼႃႇ ႁၼ်မၼ်းပၼ်ဢၼ်ၼၼ်ႉ ဝၼ်းၼႆႉဢမ်ႇပႆႇတၼ်း",
    ],
  ),
  "ဢၢၼ်": Definition(
    "ဢၢၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢၢၼ်",
    "ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ဢဝ် 'ဢႃ' ၵပ်းတင်း 'ၼ' သေ ပဵၼ်သဵင်ဢၼ်ပၢႆလႅၼ်းတူၵ်းတီႈငဝ်ႈၶဵဝ်ႈယဝ်ႉ။",
    ["ႁၢၼ်ႇ", "ၸၢၼ်း", "ၼၢၼ်း", "ယၢၼ်", "လၢၼ်", "ဝၢၼ်ႈ"],
    [
      "ႁၼ်ႁၢၼ်ႇ တႂ်ႈၸၢၼ်း ၼၢၼ်းယၢၼ် ပၢၼ်လၢၼ် ၵၢၼ်ဝၢၼ်ႈ",
      "ႁၢၼ်ႇၶေႃးယၢဝ်းတူဝ်ၼိုင်ႈ မီးယူတီႈတႂ်ႈၸၢၼ်း ႁၢၼ်ႇၼႆႉၶီႈယၢၼ်ႈၼႃႇ ၶဝ်ဢမ်ႇယူႇယၢၼ်ၵၼ် ၵိူဝ်ဝၢၼ်မီးၼႂ်းဝၢၼ်ႇ",
    ],
  ),
  "ဢိၼ်": Definition(
    "ဢိၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိ' ၵပ်းတင်း 'ၼ' သေ ပဵၼ်သဵင်ပိတ်းဢၼ်ဢွၵ်ႇသဵင်ၸႅင်ႈလီယဝ်ႉ။",
    ["လိၼ်", "သိၼ်ႈ", "ၵိၼ်", "မိၼ်ႉ", "ႁိၼ်ႉ", "သိၼ်"],
    [
      "မေႃႈလိၼ် တိၼ်သိၼ်ႈ ၵိၼ်မိၼ်ႉ ႁိၼ်ႉမိၼ် ႁိၼ်သူမ်ႈ",
      "မေႃႈလိၼ်ၼႆႉၶႅမ်ႉၼႃႇ ဢမ်ႇလီၵိၼ်ယႃႈၽိၼ်ႇ တိၼ်ပေႃးသၼ်ႇတိၼ်းတိၼ်း ၵႃႈတီႈႁိမ်းၼမ်ႉလိၼ်း ႁဝ်းလီၵမ်သိၼ်ဢိူဝ်ႈ",
    ],
  ),
  "ဢဵၼ်": Definition(
    "ဢဵၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢဵၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေ' ၵပ်းတင်း 'ၼ' သေ မီးသဵင်ယၢဝ်းသေ သဵင်ဢိၼ်ယဝ်ႉ။",
    ["တဵၼ်း", "ယဵၼ်း", "ပဵၼ်", "သဵၼ်ႈ", "လဵၼ်ႈ", "ၶဵၼ်"],
    [
      "ၾႆးတဵၼ်း ယဵၼ်းပဵၼ် ႁဵၼ်လဵၼ်း လၢႆသဵၼ်ႈ လႄႇလဵၼ်ႈ",
      "တႆႈၾႆးတဵၼ်းဝႆႉတႃႉ ယႃႇပေလဵၼ်ႈၾႆးလႄႈ ၵူဝ်ပဵၼ်ၶဵၼ်တီႈသူ ဢဝ်ၵဵၼ်ၶူဝ်းႁဝ်းမႃး ယူႇယဵၼ်ယဵၼ်ပႂ်ႉထႃႈ",
    ],
  ),
  "ဢႅၼ်": Definition(
    "ဢႅၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢႅၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢႄ' ၵပ်းတင်း 'ၼ' သေ ပဵၼ်သဵင်ပၢၵ်ႇၵႂၢင်ႈဢၼ်ပိတ်းသဵင်ၼႃယဝ်ႉ။",
    ["လႅၼ်ႈ", "ဝႅၼ်", "ၶႅၼ်ႇ", "ၵႅၼ်ႉ", "မႅၼ်ႈ", "ႁႅၼ်"],
    [
      "လႅၼ်ႈဝႅၼ် ၶႅၼ်ႇၶႅၼ်ႇ မႆႉၵႅၼ်ႉ မႅၼ်ႈဢဝ် လႅၼ်လိၼ်",
      "ၶဝ်လႅၼ်ႈဝႅၼ်ၶႅၼ်ႇၼႃႇ သိုဝ်ႉၶဝ်ႈတႅၼ်ပၼ်လႄႈ ၵမ်ဝႆႉႁႂ်ႈၵႅၼ်ႇၵႅၼ်ႇ မႅၼ်ႈၸႂ်ႁဝ်းတႄႉတႄႉ ႁႅၼ်တူၺ်းတီႈၼႆႈလူး",
    ],
  ),
  "ဢုၼ်": Definition(
    "ဢုၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢုၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူ' ၵပ်းတင်း 'ၼ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇမႃးသိုဝ်ႈသိုဝ်ႈယဝ်ႉ။",
    ["မုၼ်", "ၶုၼ်", "ႁုၼ်ႈ", "မုၼ်ႈ", "ဢုၼ်ႇ", "ပုၼ်ႈ"],
    [
      "ၸဝ်ႈမုၼ် ၶုၼ်ယႂ်ႇ ႁုၼ်ႈမုၼ်း တႃးမုၼ်ႈ ၶဝ်ႈမုၼ်း",
      "လူႇၶဝ်ႈမုၼ်းၸဝ်ႈမုၼ် ၵႃႈတီႈၽၢႆႇပုၼ်ႉၵုၼ် ၶုၼ်ၶဝ်ၵေႃႈလူႇဢိူဝ်ႈ သိူဝ်ႈၼႃဢုၼ်ႇလီၼႃႇ ႁႃပုၼ်ႈၽႂ်ႇပုၼ်ႈမၼ်း",
    ],
  ),
  "ဢူၼ်": Definition(
    "ဢူၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢူၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူဝ်' ၵပ်းတင်း 'ၼ' သေ ပဵၼ်သဵင်ဢူမ်ဝႆႉၼႂ်းပၢၵ်ႇယဝ်ႉ။",
    ["ၵူၼ်", "သူၼ်", "ၾူၼ်", "မူၼ်ႈ", "ဢူၼ်ႈ", "ထူၼ်ႈ"],
    [
      "သူၼ်ႈတိၼ် မူၼ်းလီ တူၼ်ႈႁူၼ်း ၵူၼ်မူၼ်ႇ ဝူၼ်ႉထူၼ်ႈ",
      "ၽႅၼ်ႇၵူၼ်ၼႆႉၶူၼ်ၼႃႇ တူၼ်ႈၼိဝ်ႉမီးၼႂ်းသူၼ် ၶၢဝ်းၾူၼ်ထႆသူၼ်တႃႉ မူၼ်ႈသိူဝ်းၸႂ်တႄႉတႄႉ မၼ်းဢမ်ႇႁိူဝ်ႉဢမ်ႇဢူၼ်ႈ",
    ],
  ),
  "ဢွၼ်": Definition(
    "ဢွၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢွၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေႃ' ၵပ်းတင်း 'ၼ' သေ ပဵၼ်သဵင်ပၢၵ်ႇဝူင်ႇယဝ်ႉ။",
    ["ၵွၼ်", "ၼွၼ်း", "ၶွၼ်ႇ", "ထွၼ်", "သွၼ်", "တွၼ်ႉ"],
    [
      "မႆႉၵွၼ် ႁွၼ်ႇတွၼ်ႉ မီးလွၼ်ႉ မွၼ်းၶႆႇ ၼမ်ႉပွၼ်",
      "ၵွၼ်ႇတူဝ်ၼိုင်ႈၼွၼ်းယူႇ ဢွၼ်ၵၼ်မႃးတူၺ်းလူ ၶူၼ်မၼ်းၶွၼ်ႇၶွၼ်ႇဝႆႉ ယႃႇပေလႃႈလီႈထွၼ် သွၼ်ပၼ်ႁႂ်ႈမေႃတႃႉ",
    ],
  ),
  "ဢိုၼ်": Definition(
    "ဢိုၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိုၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိုဝ်' ၵပ်းတင်း 'ၼ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇမႃးသိုဝ်ႈသိုဝ်ႈယဝ်ႉ။",
    ["ငိုၼ်း", "ပိုၼ်း", "ယိုၼ်း", "ၶိုၼ်း", "တိုၼ်ႈ", "တိုၼ်း"],
    [
      "ငိုၼ်းတိုၼ်း ၶိုၼ်ႈယႂ်ႇ ယိုၼ်ႈပၼ် ႁိုၼ်းၼႃႇ တိုၼ်ႇယဝ်ႉ",
      "မေႃႇငိုၼ်းမီးၼမ်ႉတူႈ လီႁူႉပိုၼ်းၶိူဝ်းႁဝ်း မိူဝ်းၼႃႈတေယိုၼ်းယၢဝ်း ယႃႇပေၶိုၼ်းၶိုၼ်ၼႃႈ ၵူဝ်ဝႃႈပဵၼ်ၵူၼ်းတိုၼ်ႈ",
    ],
  ),
  "ဢိူၼ်": Definition(
    "ဢိူၼ်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိူၼ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိူဝ်' ၵပ်းတင်း 'ၼ' သေ ပဵၼ်သဵင်ၼႅၼ်ႈယဝ်ႉ။",
    ["ႁိူၼ်း", "ထိူၼ်ႇ", "ပိူၼ်ႈ", "လိူၼ်", "ၽိူၼ်", "ၸိူၼ်း"],
    [
      "ႁိူၼ်းပိူၼ်ႈ ႁၼ်လိူၼ် ၸိူၼ်းၼႃႇ ယႃႇသိူၼ်ႈ ငိူၼ်ႈမၼ်း",
      "ယိူၼ်ႉၸႂ်ပႂ်ႉတီႈႁိူၼ်း ၵႂႃႇၽၼ်းမႆႉၼႂ်းထိူၼ်ႇ ယႃႇမိူၼ်ႇၼႂ်းၵႄႈပိူၼ်ႈ ၶၢဝ်းမိူဝ်ႈလိူၼ်ႁႃႈၼႆႉ ဢဝ်ၽိူၼ်မႃးၶၢႆတႃႉ",
    ],
  ),
};
final finalNgDefinitions = {
  "ဢင်": Definition(
    "ဢင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်းတူဝ်ၽႅတ်း 'င' သေ ပဵၼ်သဵင်ဢွၵ်ႇၼႂ်းၶေႃး ဢၼ်မီးသဵင်လင်ဝႆႉယဝ်ႉ။",
    ["တင်ႇ", "ၼင်ႈ", "သင်ႇ", "သင်ႉ", "ၶင်ႈ", "ၼင်"],
    [
      "တင်ႇၼင်ႈ သင်ႇဝႆႉ သင်ႉထူဝ်ႇ ၶီႈၶင်ႈ ၼမ်ႉၼင်",
      "မႃးၼင်ႈၼိူဝ်တင်ႇလႄႈ ၵင်ႈၽႃႈၵင်ႈဝႆႉတႃႉ ႁဝ်းတေပၵ်းသင်ႉထူဝ်ႇ သူၶႂ်ႈသင်ႇဢီႈသင်? ၸိုဝ်ႈလိုဝ်းလင်တႄႉတႄႉ",
    ],
  ),
  "ဢၢင်": Definition(
    "ဢၢင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢၢင်",
    "ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ဢဝ် 'ဢႃ' ၵပ်းတင်း 'င' သေ ပဵၼ်သဵင်ဢွၵ်ႇၼႂ်းၶေႃး ဢၼ်ၸႅင်ႈလႅင်းလီယဝ်ႉ။",
    ["ၸၢင်ႉ", "ယၢင်ႈ", "ၵၢင်", "တၢင်ႇ", "ၸၢင်း", "ၶၢင်"],
    [
      "ၸၢင်ႉယၢင်ႈ ၵၢင်တၢင်း ႁၢင်ႇၼႃႇ တၢင်ႇၸၢင်ႉ ၸဝ်ႈၸၢင်း",
      "ပူႇၵၢင်ႉၶီႇၸၢင်ႉမႃး ၵၢင်ၼႂ်ၸဝ်ႉၾႃႉပၢင်ႇ လၢင်ႉမေႃႈၶၢင်ဝႆႉတႃႉ ၽူႈတၢင်တူဝ်ၵူၼ်းၼုမ်ႇ ႁၢင်ႈလီႁၢင်ႈငၢမ်းတႄႉ",
    ],
  ),
  "ဢိင်": Definition(
    "ဢိင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိ' ၵပ်းတင်း 'င' သေ ပဵၼ်သဵင်ပိတ်းဢၼ်ဢွၵ်ႇသဵင်ၼႂ်းၶေႃးယဝ်ႉ။",
    ["လိင်း", "ဢိင်", "ၵိင်ႇ", "ႁိင်ႇ", "တိင်ႇ", "ၶိင်"],
    [
      "လိင်းဢိင် ၵိင်ႇမႆႉ ႁိင်ႇလင် မႄးတိင်ႇ ႁူဝ်ၶိင်",
      "လိင်းမီးၼိူဝ်ၵိင်ႇမႆႉ ၸၢႆးၸိင်ႇၼွၼ်းဢိင်သဝ် ၶိင်းၵၢင်ႉၵူဝ်ပိင်ၼႃႇ ၾိင်ႈငႄႈယႃႇႁႂ်ႈႁၢႆ ပႃးတိင်ႇပႃးၶိင်မႃး",
    ],
  ),
  "ဢဵင်": Definition(
    "ဢဵင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢဵင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေ' ၵပ်းတင်း 'င' သေ မီးသဵင်ယၢဝ်းသေ သဵင်ဢိင်ယဝ်ႉ။",
    ["ၵဵင်း", "ၽဵင်ႇ", "ပဵင်း", "သဵင်ႈ", "ၼဵင်ႈ", "တဵင်ႈ"],
    [
      "ၶႃၵဵင်း ၽဵင်ႇပဵင်း သဵင်ႈသဵင်ႈ ၵိၼ်ၼဵင်ႈ လဵင်ႉဢိမ်ႇ",
      "ဢဝ်ၵဵင်းမႃးတမ်းဝႆႉ ၵူၼ်းၼုမ်ႇၼႂ်းဝဵင်းႁဝ်း ၽွမ်ႉသဵင်ၵၼ်သဵင်ႈသဵင်ႈ တူၺ်းၵၼ်ႁႂ်ႈၽဵင်ႇၽဵင်ႇ ၵၢင်ဝၼ်းၸမ်တဵင်ႈယဝ်ႉ",
    ],
  ),
  "ဢႅင်": Definition(
    "ဢႅင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢႅင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢႄ' ၵပ်းတင်း 'င' သေ ပဵၼ်သဵင်ပၢၵ်ႇၵႂၢင်ႈဢၼ်ဢွၵ်ႇသဵင်ၼႂ်းၶေႃးယဝ်ႉ။",
    ["သႅင်", "လႅင်", "ၸႅင်ႈ", "မႅင်း", "တႅင်", "ႁႅင်း"],
    [
      "သႅင်လႅင် ၸႅင်ႈလႅင်း မႅင်းၵႅင်း တႅင်ၸိင် ႁႅင်းၸႂ်",
      "ၸၢႆးလႅင်မီးသႅင်လီ ၼႄဝႆႉႁႂ်ႈၸႅင်ႈလႅင်း ၼၢင်းသႅင်မႃးဢဝ်တႅင် ၶၢဝ်းႁိုဝ်ႉတေႃႇၶၢဝ်းႁႅင်ႈ ဝႆႉၸႂ်ၶႅင်ၶႅင်တႃႉ",
    ],
  ),
  "ဢုင်": Definition(
    "ဢုင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢုင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူ' ၵပ်းတင်း 'င' သေ ပဵၼ်သဵင်ဢွၵ်ႇၼႂ်းၶေႃးသိုဝ်ႈသိုဝ်ႈယဝ်ႉ။",
    ["ပုင်း", "ပုင်ႈ", "ၼုင်ႈ", "ႁုင်း", "ၵုင်း", "သုင်"],
    [
      "ပုင်းၼမ်ႉ သႂ်ႇၵုင်ႈ တူမ်ႈႁုင် မႂ်ႇသုင် လုင်းႁဝ်း",
      "လုင်းႁဝ်းမႄးပုင်းၼမ်ႉ ယႃႇပေဢဝ်မႆႉပုင်ႈ ၼုင်ႈၶူဝ်းၼုင်ႈၸွမ်းထုင်း မႆႉႁုင်းမီးၼိူဝ်ၵုင်း မုင်ႈတူၺ်းတီႈသုင်သုင်",
    ],
  ),
  "ဢူင်": Definition(
    "ဢူင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢူင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူဝ်' ၵပ်းတင်း 'င' သေ ပဵၼ်သဵင်ဢၼ်ဢူမ်ဝႆႉၼႂ်းပၢၵ်ႇယဝ်ႉ။",
    ["ႁူင်း", "ၽူင်း", "ၶူင်း", "လူင်း", "ထူင်", "လူင်ႈ"],
    [
      "ႁူင်းႁဵၼ်း လင်လူင် ၼမ်ႉၶူင်း လႆလူင်း တီႈၶူင်ႈ",
      "ၽုၺ်ႇႁူင်းႁဵၼ်းၸၼ်ႉသုင် ၶူးသွၼ်ၼၢင်းၶမ်းၽူင်း ပႆလူင်းႁူင်းသွၼ်မႃး ပႃးထူင်လႄႈပပ်ႉလိၵ်ႈ ဝူင်ႈၼႆႉသိုဝ်ႉလူင်ႈမိူဝ်း",
    ],
  ),
  "ဢွင်": Definition(
    "ဢွင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢွင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေႃ' ၵပ်းတင်း 'င' သေ ပဵၼ်သဵင်ပၢၵ်ႇဝူင်ႇယဝ်ႉ။",
    ["ၵွင်", "မွင်း", "တွင်း", "ၶွင်ႇ", "ႁွင်ႇ", "ၸွင်ႈ"],
    [
      "ၵွင်မွင်း တွင်းဝႆႉ လွင်ႈႁဝ်း ပွင်ႇသင် ၶၢဝ်ၶွင်ႇ",
      "ၵွင်မွင်းႁဝ်းလင်ၼႃႇ သဵင်မွင်းဝႃႈတွင်းတွင်း ၸၢႆးၶွင်ႇၼင်ႈတၢင်းႁွင်ႇ ၼၢင်းၽွင်တေႁွင်ႉၵႂၢမ်း ၼၢင်းၵွင်ၵင်ႈၸွင်ႈယူႇ",
    ],
  ),
  "ဢိုင်": Definition(
    "ဢိုင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိုင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိုဝ်' ၵပ်းတင်း 'င' သေ ပဵၼ်သဵင်ဢွၵ်ႇၼႂ်းၶေႃးသိုဝ်ႈသိုဝ်ႈယဝ်ႉ။",
    ["ၽိုင်ႈ", "ၼိုင်ႈ", "ႁိုင်", "ထိုင်", "မိုင်ႉ", "ပိုင်ႈ"],
    [
      "ႁူင်းၽိုင်ႈ ၼိုင်ႈႁိုင် ၸဵဝ်းထိုင် ဢမ်ႇၵိုင်ႇ ဢိင်ပိုင်ႈ",
      "ၽွမ်ႉၵၼ်မိူၼ်ၼင်ႇၽိုင်ႈ ၶိုင်ပွင်ၵၢၼ်မူႇၸုမ်း ႁႂ်ႈထိုင်တီႈလီလီ ယႃႇပေမိုင်ႉငဝ်ယူႇ ပူၼ်ႉမႃးႁိုင်ၼႃႇယဝ်ႉ",
    ],
  ),
  "ဢိူင်": Definition(
    "ဢိူင်",
    "တူဝ်ၽႅတ်းသဵင်လင် - ဢိူင်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိူဝ်' ၵပ်းတင်း 'င' သေ ပဵၼ်သဵင်ၼႅၼ်ႈဢွၵ်ႇၼႂ်းၶေႃးယဝ်ႉ။",
    ["ပိူင်း", "မိူင်း", "ဢိူင်ႇ", "ႁိူင်း", "လိူင်ႇ", "ယိူင်း"],
    [
      "ပိူင်းၾႆး ၸိုင်ႈမိူင်း ႁူဝ်ဢိူင်ႇ ႁိူဝ်ႈႁိူင်း လိူင်ႇလိူင်ႇ",
      "ပိူင်းၾႆးပၼ်ႁဝ်းလႄႈ ႁဝ်းတေၶိုင်ႁႂ်ႈႁိူင်း ယႃႇပေပၼ်မၼ်းပိူင်ႈ ယိူင်ႈၸွမ်းပိူင်မီးတႃႉ ႁႂ်ႈထိုင်တီႈယိူင်းမၢႆ",
    ],
  ),
};
final finalPDefinitions = {
  "ဢပ်": Definition(
    "ဢပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်းတူဝ်ၽႅတ်း 'ပ' သေ ပဵၼ်သဵင်ဢွၵ်ႇပိတ်းပၢၵ်ႇ ဢၼ်သဵင်ၶၢတ်ႇၵႂႃႇၵမ်းလဵဝ်ယဝ်ႉ။",
    ["ၶပ်ႉ", "ပပ်ႉ", "ၼပ်ႉ", "ၸပ်း", "လပ်း", "တပ်ႉ"],
    [
      "ၶပ်ႉပပ်ႉ ၼပ်ႉတူၺ်း ၸပ်းၸပ်း ယႃႇလပ်း ၼႂ်းတပ်ႉ",
      "တေႁၼ်ၼႂ်းပပ်ႉယူႇ ၶပ်ႉႁႂ်ႈၸပ်းၸပ်းတႃႉ ၼပ်ႉၼပ်ႉသွၼ်ႇသွၼ်ႇလႄႈ လိူၼ်လပ်းလပ်ႉလႅဝ်းဝႆႉ ႁဝ်းတေၵႂႃႇႁပ်ႉသူ",
    ],
  ),
  "ဢၢပ်": Definition(
    "ဢၢပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢၢပ်",
    "ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ဢဝ် 'ဢႃ' ၵပ်းတင်း 'ပ' သေ ပဵၼ်သဵင်ပိတ်းပၢၵ်ႇ ဢၼ်ဢွၵ်ႇသဵင်ၸႅင်ႈလီယဝ်ႉ။",
    ["ၵၢပ်ႇ", "ၶၢပ်ႈ", "ႁၢပ်ႇ", "ယၢပ်ႇ", "လၢပ်ႇ", "ပၢပ်ႈ"],
    [
      "ၵၢပ်ႇမိူဝ်ႈ မီးၶၢပ်ႈ ႁၢပ်ႇၵၢပ်ႇ ဢမ်ႇယၢပ်ႇ ယႃႇလၢပ်ႇ",
      "ၸွႆႈၵၼ်ႁၢပ်ႇဢမ်ႇယၢပ်ႇ ၽႂ်မၢပ်ႇႁဝ်းဢမ်ႇလႆႈ ၵၢပ်ႇၼႃတီႈငၢပ်ႇၽႃ ၶၢပ်ႈၵၢပ်ႇမိူဝ်ႈၵေႃႈမီး ပၢပ်ႈဢဝ်ယၢပ်ႇတႄႉတႄႉ",
    ],
  ),
  "ဢိပ်": Definition(
    "ဢိပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိ' ၵပ်းတင်း 'ပ' သေ ပဵၼ်သဵင်ပိတ်းပၢၵ်ႇ ဢၼ်ဢွၵ်ႇသဵင်ပိတ်းယဝ်ႉ။",
    ["ယိပ်း", "ၵိပ်ႈ", "လိပ်း", "သိပ်း", "ႁိပ်ႇ", "ၺိပ်ႈ"],
    [
      "ယိပ်းၵိပ်ႈ ယႃႇႁိပ်ႈ မႆႉလိပ်း သိပ်းလႅမ်ႈ ႁိပ်ႇၺိပ်ႈ",
      "ဢဝ်ထူႇၵိပ်ႈဝႆႉလႄႈ ယႃႇပေယိပ်းတပ်းလိပ်း မႆႉလိပ်းမီးသိပ်းလႅမ်ႈ ယႃႇပေဢဝ်တိၼ်ထိပ်ႇ ၵူဝ်ၶႃသူလိပ်ႈဢိူဝ်ႈ",
    ],
  ),
  "ဢဵပ်": Definition(
    "ဢဵပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢဵပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေ' ၵပ်းတင်း 'ပ' သေ မီးသဵင်ယၢဝ်းသေ သဵင်ဢိပ်ယဝ်ႉ။",
    ["ၵဵပ်း", "ႁဵပ်း", "ယဵပ်ႇ", "ၼဵပ်ႉ", "ၸဵပ်း", "ယဵပ်ႉ"],
    [
      "ၵဵပ်းႁဵပ်း ယဵပ်ႇၼဵပ်ႉ ဢမ်ႇၸဵပ်း လဵပ်ႈႁဵၼ်း ယဵပ်ႉသိူဝ်ႈ",
      "မႃးလႄႈႁဝ်းၵဵပ်းႁဵပ်း ၼဵပ်ႉမိုဝ်းသူယၢဝ်းၼႃႇ ယႃႇယဵပ်ႇၶိုၼ်ႈယဵပ်ႇလူင်း လဵပ်ႈမႃးၽၢႆႇၼႆႉလႄႈ သူယဵပ်ႉၶူဝ်းယဝ်ႉၼႄႇ",
    ],
  ),
  "ဢႅပ်": Definition(
    "ဢႅပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢႅပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢႄ' ၵပ်းတင်း 'ပ' သေ ပဵၼ်သဵင်ပၢၵ်ႇၵႂၢင်ႈ ဢၼ်ပိတ်းသဵင်ၶၢတ်ႇယဝ်ႉ။",
    ["ၶႅပ်း", "လႅပ်ႈ", "ၶႅပ်ႈ", "ၽႅပ်ႉ", "ၵႅပ်ႇ", "တႅပ်း"],
    [
      "တိုဝ်းၶႅပ်း လႅပ်ႈလႅပ်ႈ ၶဝ်ႈၶႅပ်ႈ ၶႅပ်းၽႅပ်ႉ ၵႅပ်ႇၵႄႇ",
      "တိုဝ်းၶႅပ်းႁႂ်ႈလႅပ်ႈလႅပ်ႈ ယႃႇပေၽႅပ်ႉတႃတူၺ်း ၵူဝ်တႃၸဵပ်းသႅပ်ႇဢိူဝ်ႈ ထူဝ်ႇတႅပ်ႇမီးၼႂ်းသူၼ် ယႃႇပေတႅပ်းၶိူဝ်းမၼ်း",
    ],
  ),
  "ဢုပ်": Definition(
    "ဢုပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢုပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူ' ၵပ်းတင်း 'ပ' သေ ပဵၼ်သဵင်ဢွၵ်ႇမႃးတီႈႁူၺ်ႇပၢၵ်ႇယဝ်ႉ ပိတ်းသဵင်ယဝ်ႉ။",
    ["သုပ်း", "ၵုပ်း", "ဢုပ်ႇ", "ထုပ်ႉ", "ဢုပ်း", "လုပ်ႇ"],
    [
      "သုပ်းၵုပ်း ဢုပ်ႇၵၼ် ပေႃႉထုပ်ႉ ဢုပ်းၶမ်း လုပ်ႇသိူဝ်",
      "သုပ်းၵုပ်းသေဢုပ်ႇၵၼ် မႂ်းၼႆႉလုပ်ႉလၢပ်ႉၼႃႇ တုပ်ႇၸွင်ႈဝႆႉသေလႄႈ ၼိူဝ်ႉဢုပ်ႉမီးၼႂ်းဢုပ်း ယႃႇပေထုပ်ႉပေႃႉၼႃႈ",
    ],
  ),
  "ဢူပ်": Definition(
    "ဢူပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢူပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူဝ်' ၵပ်းတင်း 'ပ' သေ ပဵၼ်သဵင်ဢၼ်ဢူမ်ဝႆႉၼႂ်းပၢၵ်ႇသေပိတ်းယဝ်ႉ။",
    ["ၵူပ်း", "ဢူပ်ႇ", "ပူပ်ႇ", "ႁူပ်ႉ", "တူပ်း", "ၶူပ်း"],
    [
      "သူပ်းၵူပ်း ဢူပ်ႇပူပ်ႇ ႁူပ်ႉထူပ်း တူပ်းမိုဝ်း ပူပ်ႉပူပ်ႉ",
      "ၵူပ်းၼႆႉဢမ်ႇၸၢင်ႈၶူပ်း တူပ်ႉၽႃႈလူပ်းသူလႄႈ ၶူပ်းၶူပ်းၶိုၼ်ႈၶိုၼ်ႈၼႃႇ ယႃႇဢႃႈသူပ်းႁႅၼ်ၵၢင်း ငူပ်ႉဝၢၼ်ႇဝႆႉသေလႄႈ",
    ],
  ),
  "ဢွပ်": Definition(
    "ဢွပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢွပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေႃ' ၵပ်းတင်း 'ပ' သေ ပဵၼ်သဵင်ပၢၵ်ႇဝူင်ႇဢၼ်ပိတ်းသဵင်ၶၢတ်ႇယဝ်ႉ။",
    ["ႁွပ်ႇ", "တွပ်ႇ", "လွမ်ႉ", "ၶွပ်ႈ", "ၵွပ်း", "သွပ်ႉ"],
    [
      "ဢုမ်ႈႁွပ်ႇ တွပ်ႇထဵင် လွမ်ႉႁွပ်ႈ ၶွပ်ႈၼႃႇ ၽႃႈၵွပ်း",
      "ႁွပ်ႇၼွင်ႉသူဝႆႉလႄႈ ၶွပ်ႈၶူပ်ႇၼိုင်ႈပီၼႆႉ လီတွပ်ႇၵုင်ႇပေႃႈမႄႈ ၵွပ်ႈၶဝ်တူၺ်းထိုင်ႁဝ်း သွပ်ႉသႅပ်ႉတွပ်ႇၵႂၢမ်းၶဝ်",
    ],
  ),
  "ဢိုပ်": Definition(
    "ဢိုပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိုပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိုဝ်' ၵပ်းတင်း 'ပ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇပိတ်းသဵင်သိုဝ်ႈသိုဝ်ႈယဝ်ႉ။",
    ["ၶိုပ်ႈ", "သိုပ်ႇ", "လိုပ်ႈ", "ငိုပ်း", "ဢိုပ်း", "တိုပ်ႈ"],
    [
      "ၶိုပ်ႈၼိုင်ႈ ၶိုၼ်းသိုပ်ႇ လိုပ်ႈၵၼ် တီႈငိုပ်း ဢမ်ႇဢိုပ်း",
      "မႆသိုပ်ႇမီးလၢႆၶိုပ်ႈ လီလိုပ်ႈၸိူဝ်းၽူႈၶဵၼ် ပေႃးၶၢၼ်ႉၸၢင်ႈဢိုပ်းဢိူဝ်ႈ တီႈငိုပ်းၼႆႉဢမ်ႇလီ ယႃႇပေတိုပ်ႈတိၼ်လႄႈ",
    ],
  ),
  "ဢိူပ်": Definition(
    "ဢိူပ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိူပ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိူဝ်' ၵပ်းတင်း 'ပ' သေ ပဵၼ်သဵင်ၼႅၼ်ႈ ဢၼ်ပိတ်းသဵင်ၶၢတ်ႇယဝ်ႉ။",
    ["ငိူပ်ႇ", "ၵိူပ်ႇ", "ဢိူပ်ႇ", "ပိူပ်ႈ", "ဢိူပ်း", "လိူပ်ႇ"],
    [
      "ငိူပ်ႇၽႃ ပဵၼ်ၵိူပ်ႇ မီးဢိူပ်ႇ ပိူပ်ႈၼမ်ႉ ၼၢႆးဢိူပ်း",
      "တီႈငိူပ်ႇၽႃမီးထမ်ႈ ၼႂ်းထမ်ႈမီးဢိူပ်ႇၶမ်း မီးတီႈလွႆၽႃငိူပ်ႇ ဢဝ်ဝႆႉၼႂ်းပိူပ်ႈၼမ်ႉ ဢိူပ်ႇၶူဝ်းၵေႃႈမီးဢိူဝ်ႈ",
    ],
  ),
};
final finalTDefinitions = {
  "ဢတ်": Definition(
    "ဢတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်းတူဝ်ၽႅတ်း 'တ' သေ ပဵၼ်သဵင်ဢၼ်ပၢႆလႅၼ်းတႅၵ်ႇတီႈငဝ်ႈၶဵဝ်ႈသေၶၢတ်ႇၵႂႃႇယဝ်ႉ။",
    ["ၵတ်ႉ", "ႁတ်း", "ၵတ်း", "ၶတ်း", "လတ်း", "ဝတ်ႉ"],
    [
      "ၵူၼ်းၵတ်ႉ ႁတ်းပတ်ႉ ဢမ်ႇၵတ်း ပေႃးၶတ်း ဝတ်ႉလႄႈ",
      "ၽူႈၸၢႆးၵူၼ်းၵတ်ႉ မီးတၢင်းႁတ်းႁၢၼ် ၵတ်းၵေႃႈဢမ်ႇၵူဝ် ယႃႇပေၶတ်းမၼ်း လတ်းၵႂႃႇသိုဝ်ႈသိုဝ်ႈ",
    ],
  ),
  "ဢၢတ်": Definition(
    "ဢၢတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢၢတ်",
    "ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ဢဝ် 'ဢႃ' ၵပ်းတင်း 'တ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇၸႅင်ႈလႅင်းလီယဝ်ႉ။",
    ["သၢတ်ႇ", "ၵၢတ်ႇ", "လၢတ်ႈ", "ၽၢတ်ႇ", "ၸၢတ်ႈ", "ဝၢတ်ႈ"],
    [
      "သၢၼ်သၢတ်ႇ ၶၢႆၶၢတ်ႇ ၼႂ်းၵၢတ်ႇ လၢတ်ႈႁႃ ဢမ်ႇၽၢတ်ႇ",
      "ၶၢႆသၢတ်ႇတီႈၼႂ်းၵၢတ်ႇ ၵႂႃႇလၢတ်ႈႁႃလွႆးလွႆး ယႃႇႁႂ်ႈလႆႈၽၢတ်ႇၵၼ် ၸိူဝ်ႉၸၢတ်ႈၶိူဝ်းၵူၼ်းႁဝ်း ဝၢတ်ႈပၢင်ၵႂၢင်ႈၵႂၢင်ႈလႄႈ",
    ],
  ),
  "ဢိတ်": Definition(
    "ဢိတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိ' ၵပ်းတင်း 'တ' သေ ပဵၼ်သဵင်ပိတ်းဢၼ်ဢွၵ်ႇသဵင်ၸႅင်ႈလီယဝ်ႉ။",
    ["မိတ်ႈ", "ဝိတ်ႉ", "လိတ်ႉ", "ၽိတ်း", "ၶိတ်ႇ", "ပိတ်ႉ"],
    [
      "မိတ်ႈဝိတ်ႉ ၸိတ်းဢႅင်ႈ ဢိတ်းဢိတ်း ၸၢင်ႈၽိတ်း ပိတ်ႉလႄႈ",
      "ဢဝ်မိတ်ႈဝိတ်ႉမႃးတႃႉ ႁဝ်းတေလိတ်ႉၵိင်ႇမႆႉ ယႃႇပေလၢတ်ႈၵႂၢမ်းၽိတ်း ၾႆးၶိတ်ႇထုပ်ႉၵႃႈႁိုဝ်? လိတ်ႈတူၺ်းလီလီလႄႈ",
    ],
  ),
  "ဢဵတ်": Definition(
    "ဢဵတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢဵတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေ' ၵပ်းတင်း 'တ' သေ မီးသဵင်ယၢဝ်းသေ သဵင်ဢိတ်ယဝ်ႉ။",
    ["ပဵတ်း", "ႁဵတ်း", "တဵတ်ႇ", "သဵတ်ႈ", "ပဵတ်ႈ", "ၶဵတ်ႇ"],
    [
      "ပဵတ်းဢၢတ်ႇ ၸဵတ်းတူဝ် တဵတ်ႇယူႇ ဢဵတ်ႇသဵတ်ႇ ၶဵတ်ႇၵူဝ်",
      "လဵင်ႉပဵတ်းဝႆႉၼမ်ၼမ် ႁဵတ်းသင်ႁဵတ်းတႄႉတႄႉ ယူႇတဵတ်ႇတဵတ်ႇယဵၼ်ယဵၼ် ပဵၼ်ႁိုဝ်ၵေႃႈဢမ်ႇသဵတ်ႈ သူမေႃသၢၼ်ပဵတ်ႈႁႃႉ?",
    ],
  ),
  "ဢႅတ်": Definition(
    "ဢႅတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢႅတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢႄ' ၵပ်းတင်း 'တ' သေ ပဵၼ်သဵင်ပၢၵ်ႇၵႂၢင်ႈဢၼ်ပိတ်းသဵင်ယဝ်ႉ။",
    ["ၸႅတ်ႈ", "ပႅတ်ႈ", "တႅတ်ႈ", "ၼႅတ်ႈ", "လႅတ်ႇ", "ၵႅတ်း"],
    [
      "တႃမႅတ်း ယႃႇပႅတ်ႈ ၼႅတ်ႈဢဝ် ၵိမ်းၵႅတ်း တႅတ်ႈတႅတ်ႈ",
      "ၽႂ်ပဵၼ်တႆးၸႅတ်ႈၸႅတ်ႈ ယႃႇပေပႅတ်ႈၸ်ိူဝ်ႉၶိူဝ်း ႁဵတ်းသင်ႁဵတ်းတႅတ်ႈၼႅတ်ႈ ႁိူဝ်ႈလႅင်းမိူၼ်သၢႆလႅတ်ႇ ၵႅတ်းပႅတ်ႈၼိပ်ႉမိုဝ်းသူ",
    ],
  ),
  "ဢုတ်": Definition(
    "ဢုတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢုတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူ' ၵပ်းတင်း 'တ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇမႃးတီႈႁူၺ်ႇပၢၵ်ႇယဝ်ႉၶၢတ်ႇၵႂႃႇယဝ်ႉ။",
    ["သုတ်း", "လုတ်ႇ", "ၵုတ်ႈ", "လုတ်ႈ", "သုတ်ႉ", "ၶုတ်း"],
    [
      "ယႃႁုတ်း ၼႂ်းသုတ်း မႆႉၵုတ်ႇ ၶုတ်းလိၼ်",
      "ၵၢင်သုတ်းဝႆႉထႃႈလႄႈ ယႃႇပေလုတ်ႇယႃႈၽိၼ်ႇ မေႃႇသႅင်မီးမိူင်းၵုတ်ႈ ၵူဝ်လုတ်ႈမိုဝ်ႉလုတ်ႈယၢမ်း သုတ်ႉမႃးၸမ်ၸမ်တႃႉ",
    ],
  ),
  "ဢူတ်": Definition(
    "ဢူတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢူတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူဝ်' ၵပ်းတင်း 'တ' သေ ပဵၼ်သဵင်ဢူမ်ဝႆႉၼႂ်းပၢၵ်ႇသေၶၢတ်ႇယဝ်ႉ။",
    ["ၶုတ်ႇ", "ၼူတ်ႇ", "မူတ်း", "ၽူတ်ႉ", "ႁူတ်း", "ၵူတ်ႉ"],
    [
      "ၶုတ်ႇၼူတ်ႇ မူတ်းမူတ်း ၶူတ်းၵူတ်ႇ ၼမ်ႉၽူတ်ႉ ႁူတ်းၾႆး",
      "ၶုတ်ႇၼူတ်ႇမူတ်းမူတ်း ၼမ်ႉမႆႈဢမ်ႇပႆႇၽူတ်ႉ ယႃႇပေၼႅတ်ႈႁူတ်းၾႆး ဝူတ်ႈၶႅၼ်သိူဝ်ႈသေလႄႈ ၵူၼ်းၸႂ်ၵူတ်ႉဢမ်ႇလီ",
    ],
  ),
  "ဢွတ်": Definition(
    "ဢွတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢွတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေႃ' ၵပ်းတင်း 'တ' သေ ပဵၼ်သဵင်ပၢၵ်ႇဝူင်ႇယဝ်ႉ။",
    ["ယွတ်ႈ", "ၽွတ်ႉ", "ပွတ်း", "လွတ်ႈ", "ၸွတ်ႇ", "ႁွတ်ႈ"],
    [
      "ယွတ်ႈမႆႉ မႆႉၽွတ်ႉ ပွတ်းၼႃႇ ၼမ်ႉၽူတ်ႉ ႁူတ်းၾႆး",
      "ယွတ်ႈမႆႉၽွတ်ႉပွတ်းၼႃႇ ၸၢႆးယွတ်ႈႁႃဝူဝ်းလွတ်ႈ ႁႃတူၺ်းႁႂ်ႈၸွတ်ႇၸွတ်ႇ ႁွတ်ႈၽႅဝ်တူၼ်ႈမႆႉၼွတ်ႈ ၸၢႆးဢွတ်ႉထွတ်ႇဢုတ်ႇယူႇ",
    ],
  ),
  "ဢိုတ်": Definition(
    "ဢိုတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိုတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိုဝ်' ၵပ်းတင်း 'တ' သေ ပဵၼ်သဵင်ဢွၵ်ႇသိုဝ်ႈသိုဝ်ႈသေၶၢတ်ႇယဝ်ႉ။",
    ["တိုတ်ႉ", "ၽိုတ်ႇ", "ၵိုတ်း", "ၶိုတ်း", "မိုတ်ႈ", "ယိုတ်ႈ"],
    [
      "ၸွႆႈတိုတ်ႉ ယိုတ်ႈယိုတ်ႈ ဢမ်ႇၵိုတ်း ၽိုတ်ႇၼႃႇ ႁိုတ်းထႃႉ",
      "ၸွႆႈၵၼ်တိုတ်ႉႁႂ်ႈပႄႉ ယႃႇပေၵူဝ်ယၢပ်ႇၽိုတ်ႇ ၶဝ်ၵိုတ်းပႂ်ႉႁဝ်းယူႇ ၵႂႃႇႁႂ်ႈၶိုတ်းၶဝ်လႄႈ လီမိုတ်ႈၵၼ်တႄႉတႄႉ",
    ],
  ),
  "ဢိူတ်": Definition(
    "ဢိူတ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိူတ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိူဝ်' ၵပ်းတင်း 'တ' သေ ပဵၼ်သဵင်ၼႅၼ်ႈသေၶၢတ်ႇယဝ်ႉ။",
    ["ႁိူတ်ႈ", "ၵိူတ်ႇ", "လိူတ်ႈ", "မိူတ်ႇ", "ယိူတ်ႈ", "ဢိူတ်ႇ"],
    [
      "ႁိူတ်ႈၶူပ်း ၵိၼ်လိူတ်ႈ ဝၼ်းၵိူတ်ႇ ၼမ်ႉလိူတ်ႇ ၾူၼ်ႁိူတ်ႇ",
      "ႁိူတ်ႈၶူပ်းၼႆႉဢမ်ႇလီ ပဵၼ်ဝၢၼ်ႈၵိူတ်ႇမိူင်းၼွၼ်း ၼိူဝ်ႉလိူတ်ႈၶိူဝ်းၵူၼ်းႁဝ်း မၼ်းဢမ်ႇၸႂ်ႈမႆႉမိူတ်ႇ သူၵိူတ်ႇမိူဝ်ႈပီႊလႂ်?",
    ],
  ),
};
final finalKDefinitions = {
  "ဢၵ်": Definition(
    "ဢၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢ' ၵပ်းတင်းတူဝ်ၽႅတ်း 'ၵ' သေ ပဵၼ်သဵင်ဢွၵ်ႇၼႂ်းၶေႃး ဢၼ်ၶၢတ်ႇၵႂႃႇၵမ်းလဵဝ်ယဝ်ႉ။",
    ["သၵ်ႉ", "လၵ်း", "ပၵ်း", "ၸၵ်း", "ၽၵ်း", "ပၵ်ႉ"],
    [
      "သၵ်ႉၶူဝ်း မႆႉလၵ်း ပၵ်းဝႆႉ ႁူႉၸၵ်း ၽၵ်းပၵ်ႉ",
      "ၵႆႉသၵ်ႉၶူဝ်းသူလႄႈ သၵ်ႉၼိူဝ်ပႅၼ်ႈမႆႉႁၵ်ႉ မႆႉသၵ်းႁဵတ်းၶွၼ်ႉသၵ်ႉ ၵူၼ်းၵၵ်းလၵ်ႉၽၵ်းပၵ်ႉ ပိူၼ်ႈဢွၼ်ၵၼ်တၵ်ႉမၼ်း",
    ],
  ),
  "ဢၢၵ်": Definition(
    "ဢၢၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢၢၵ်",
    "ပဵၼ်သရသဵင်ယၢဝ်း ဢၼ်ဢဝ် 'ဢႃ' ၵပ်းတင်း 'ၵ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇၼႂ်းၶေႃး ဢၼ်ၸႅင်ႈလႅင်းလီယဝ်ႉ။",
    ["ၸၢၵ်ႈ", "ၽၢၵ်ႇ", "ပၢၵ်ႇ", "ငၢၵ်ႈ", "တၢၵ်ႇ", "လၢၵ်ႈ"],
    [
      "ၸၢၵ်ႈယဵပ်ႉ ၶူဝ်းၽၢၵ်ႇ ႁႃႈပၢၵ်ႇ ဢမ်ႇငၢၵ်ႈ တၢၵ်ႇၽၢၵ်ႈ",
      "ႁဝ်းတေၵႂႃႇသိုဝ်ႉၸၢၵ်ႈ ပဵၼ်တႃႇလွင်ႈမၢၵ်ႈမီး တေၽၢၵ်ႇတွၼ်ႈသူဢိူဝ်ႈ ၵူႈယႃမၢၵ်ႇဝႆႉတႃႉ လၢၵ်ႈၽၢၵ်ႈတၢၵ်ႇသေလႄႈ",
    ],
  ),
  "ဢိၵ်": Definition(
    "ဢိၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိ' ၵပ်းတင်း 'ၵ' သေ ပဵၼ်သဵင်ပိတ်းၼႂ်းၶေႃး ဢၼ်ဢွၵ်ႇသဵင်ၸႅင်ႈလီယဝ်ႉ။",
    ["လိၵ်ႈ", "ၸိၵ်း", "သိၵ်ႇ", "ပိၵ်ႈ", "တိၵ်း", "ၶိၵ်း"],
    [
      "ပပ်ႉလိၵ်ႈ တီႈၸိၵ်း ဢမ်ႇသိၵ်ႇ သိုဝ်ႉပိၵ်ႈ လိၵ်းတႃ",
      "ယႃႇပေသိၵ်ႇပပ်ႉလိၵ်ႈ လိၵ်ႈလၢႆးပၼ်တၢင်းႁူႉ ၶတ်းၸႂ်ႁဵၼ်းတိၵ်းတိၵ်း ႁႂ်ႈထိုင်တီႈၸိၵ်းၸွမ် လွမ်ၶူဝ်ယူႇၶိၵ်းၶိၵ်း",
    ],
  ),
  "ဢဵၵ်": Definition(
    "ဢဵၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢဵၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေ' ၵပ်းတင်း 'ၵ' သေ မီးသဵင်ယၢဝ်းသေ သဵင်ဢိၵ်ယဝ်ႉ။",
    ["လဵၵ်း", "ဝဵၵ်ႉ", "ႁဵၵ်ႇ", "တဵၵ်း", "လဵၵ်ႉ", "ယၵ်ႉ"],
    [
      "သဵမ်လဵၵ်း ဝဵၵ်ႉသူၼ် ႁဵၵ်ႇဢူၼ်ႈ မိုဝ်းတဵၵ်း လဵၵ်ႉလဵၵ်ႉ",
      "ၸၢႆးလဵၵ်းဝဵၵ်ႉသူၼ်ယူႇ ယႃႇပေတဵၵ်းၼဵၵ်းမၼ်း ၽၵ်းသူမ်ႈတဵၵ်းဝၢၼ်ၼႃႇ ဢဝ်သႂ်ႇပုင်းႁဵၵ်ႇမႃး ၼၢင်းလဵၵ်ႉယၵ်ႉၸမ်ႈယူႇ",
    ],
  ),
  "ဢႅၵ်": Definition(
    "ဢႅၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢႅၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢႄ' ၵပ်းတင်း 'ၵ' သေ ပဵၼ်သဵင်ပၢၵ်ႇၵႂၢင်ႈဢၼ်ပိတ်းသဵင်ၼႂ်းၶေႃးယဝ်ႉ။",
    ["ပႅၵ်ႇ", "တႅၵ်ႇ", "မႅၵ်ႇ", "လႅၵ်ႈ", "ၶႅၵ်ႇ", "ၸႅၵ်ႇ"],
    [
      "လွႆပႅၵ်ႇ ဢမ်ႇတႅၵ်ႇ မႅၵ်ႇမႆႉ ၵႆႉလႅၵ်ႈ ၶႅၵ်ႇမႃး",
      "ႁဝ်းမီးလွႆပႅၵ်ႇ ဝႆႉလႅၵ်ႈဢဝ်ငိုၼ်းၶမ်း ယႃႇပေတႅၵ်ႇၵၼ်တႃႉ ၸွႆႈၵၼ်ၵႂႃႇမႅၵ်ႇပႅၵ်ႇ ၸႅၵ်ႇႁႂ်ႈၵႃႈၵၼ်လႄႈ",
    ],
  ),
  "ဢုၵ်": Definition(
    "ဢုၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢုၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူ' ၵပ်းတင်း 'ၵ' သေ ပဵၼ်သဵင်ဢၼ်ဢွၵ်ႇၼႂ်းၶေႃးသိုဝ်ႈသိုဝ်ႈယဝ်ႉၶၢတ်ႇၵႂႃႇယဝ်ႉ။",
    ["သုၵ်ႈ", "လုၵ်ႉ", "ၸုၵ်း", "တုၵ်း", "သုၵ်း", "ထုၵ်ႇ"],
    [
      "သုၵ်ႈၼႃႈ လုၵ်ႉၸုၵ်း တုၵ်းသုၵ်း ဢုၵ်းလုၵ်း ၽုၵ်ႇမုၵ်း",
      "လုၵ်ႉသုၵ်ႈၼႃႈလီငၢမ်း ၶုၵ်းၸႂ်လႆႈတူၼ်ႈၵုၵ်ႉ မိူဝ်ႈၽုၵ်ႈလုၵ်ႉၸဝ်ႉၸဝ်ႉ ထုၵ်ႇလီသွၼ်လုၵ်ႈဢွၼ်ႇ ၶဝ်ႈပုၵ်းၶၢႆထုၵ်ႇၼႃႇ",
    ],
  ),
  "ဢူၵ်": Definition(
    "ဢူၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢူၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢူဝ်' ၵပ်းတင်း 'ၵ' သေ ပဵၼ်သဵင်ဢူမ်ဝႆႉၼႂ်းပၢၵ်ႇသေၶၢတ်ႇၼႂ်းၶေႃးယဝ်ႉ။",
    ["ၼူၵ်ႉ", "ၵူၵ်ႇ", "ႁူၵ်း", "မူၵ်း", "ၶူၵ်ႉ", "တူၵ်း"],
    [
      "ၼူၵ်ႉၶူၵ်ႇ ႁူၵ်းတူဝ် မူၵ်းယူႇ တီႈၶူၵ်ႉ",
      "ၼူၵ်ႉၵူၵ်ႇၵၢၵ်ႈႁူၵ်းတူဝ် တူၵ်းၼႂ်းပႃႇမႆႉပူၵ်ႇ သဵင်ႁွင်ႉဝႃႈပူၵ်းပူၵ်း မီးယူႇတီႈယုမ်းႁူၵ်ႉ ပူၵ်ႉၶူဝ်းသူတူၵ်းၼေႈ",
    ],
  ),
  "ဢွၵ်": Definition(
    "ဢွၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢွၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢေႃ' ၵပ်းတင်း 'ၵ' သေ ပဵၼ်သဵင်ပၢၵ်ႇဝူင်ႇယဝ်ႉ။",
    ["ၵွၵ်း", "မွၵ်ႇ", "ဢွၵ်ႇ", "သွၵ်ႈ", "ၸွၵ်ႉ", "ပွၵ်ႈ"],
    [
      "ၵွၵ်းမွၵ်ႇ ဢဝ်ဢွၵ်ႇ သွၵ်ႈႁႃ ၼႂ်းၸွၵ်ႉ ငွၵ်ႈတူၺ်း",
      "ဢဝ်မွၵ်ႇသႂ်ႇၵွၵ်းယဝ်ႉ မႃးၵိၼ်မၢၵ်ႇၸွၵ်းလႄႈ ယႃႇပေယူႇၸွမ်းၸွၵ်ႉ ႁဝ်းၶၢၼ်ႉသွၵ်ႈႁႃသူ ပွၵ်ႈမႃးဝႆးဝႆးလႄႈ",
    ],
  ),
  "ဢိုၵ်": Definition(
    "ဢိုၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိုၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိုဝ်' ၵပ်းတင်း 'ၵ' သေ ပဵၼ်သဵင်ဢွၵ်ႇသိုဝ်ႈသိုဝ်ႈသေၶၢတ်ႇယဝ်ႉ။",
    ["သိုၵ်း", "တိုၵ်း", "တိုၵ်ႉ", "ၽိုၵ်း", "လိုၵ်ႉ", "ၶိုၵ်ႉ"],
    [
      "လုၵ်ႈသိုၵ်း တိုၵ်းသိုၵ်း တိုၵ်ႉၽိုၵ်း ၼမ်ႉလိုၵ်ႉ ၶိုၵ်ႉၼႃႇ",
      "သိုၵ်းတိုၼ်းၵိုၵ်းၵမ်ႇၽႃႇ တိုၵ်းသိုၵ်းၵေႃႈယႃႇၵူဝ် လီၶႂ်ႈၸႂ်လိုၵ်ႉလိုၵ်ႉ ၽင်ႇႁိုၵ်းပဵင်းၼႃႈဢိုၵ်း ၽိုၵ်းတႅမ်ႈလိၵ်ႈၵူႈၶမ်ႈ",
    ],
  ),
  "ဢိူၵ်": Definition(
    "ဢိူၵ်",
    "တူဝ်ၽႅတ်းသဵင်ၶၢတ်ႇ - ဢိူၵ်",
    "ပဵၼ်သရဢၼ်ဢဝ် 'ဢိူဝ်' ၵပ်းတင်း 'ၵ' သေ ပဵၼ်သဵင်ၼႅၼ်ႈသေၶၢတ်ႇယဝ်ႉ။",
    ["လိူၵ်ႈ", "ၸိူၵ်ႈ", "ၽိူၵ်ႇ", "တိူၵ်ႈ", "မိူၵ်ႈ", "ပိူၵ်ႇ"],
    [
      "လိူၵ်ႈၸိူၵ်ႈ ၽိူၵ်ႇၽိူၵ်ႇ ဢမ်ႇတိူၵ်ႈ ယႃႇမိူၵ်ႈ လိူၵ်ႈပိူၵ်ႇ",
      "ၵူၼ်းတိူၵ်ႈလႄႈၵူၼ်းမိူၵ်ႈ မၼ်းဢမ်ႇထိူၵ်ႈဢွၼ်ႁူဝ် ပေႃးၵူဝ်မႃးၼႃႈၽိူၵ်ႇ လီလိူၵ်ႈဢဝ်ၸိူၵ်ႈ mတ်ႉ ပၼ်မၼ်းၵိၼ်ၶဝ်ႈပိူၵ်ႇ",
    ],
  ),
};

class Definition {
  final String id;
  final String title;
  final String description;
  final List<String> spelling;
  final List<String> usages;
  final bool isPlayable;

  Definition(
    this.id,
    this.title,
    this.description,
    this.spelling,
    this.usages, [
    this.isPlayable = false,
  ]);
}

String transliterateShan(String shanChar) {
  // Mapping of Shan consonants to their inherent Latin sounds
  final Map<String, String> mapping = {
    'ၵ': 'ka',
    'ၶ': 'kha',
    'င': 'nga',
    'ၸ': 'ja',
    'သ': 'sa',
    'ၺ': 'nya',
    'တ': 'ta',
    'ထ': 'tha',
    'ၼ': 'na',
    'ပ': 'pa',
    'ၽ': 'pha',
    'ၾ': 'fa',
    'မ': 'ma',
    'ယ': 'ya',
    'ရ': 'ra',
    'လ': 'la',
    'ဝ': 'wa',
    'ႁ': 'ha',
    'ဢ': 'a',
  };

  // Return the mapping, or the original character if not found
  return mapping[shanChar] ?? shanChar;
}
